{
  "1f7f1a7a-f396-453d-9de9-8c2276c793c6": {
    "c26975db-3ddb-4764-b204-e4531754c5bf": {
      "name": "summary_Summary_of_the_Constitution_of_Kenya_2010_2025-12-19T11-17-44.pdf",
      "content": [
        "SUMMARY\nSummary of the Constitution of Kenya, 2010\nDate: December 19, 2025\nKenya has a written constitution, promulgated in 2010, which serves as the supreme law of the\nRepublic. Key aspects include:\n1. Preamble: Declares the people's sovereignty and core aspirations, emphasizing values like\npeace, human rights, equality, freedom, and democracy.\n2. Article 1 (Sovereignty of the People): States that all sovereign power belongs to the people.\n3. Article 10 (National Values and Principles of Governance): Outlines important principles such\nas patriotism, national unity, rule of law, human dignity, and social justice.\n4. Chapter Four (The Bill of Rights): A cornerstone protecting fundamental rights and freedoms,\nincluding the right to life, equality, human dignity, freedom and security of the person, protection\nof property, and socio-economic rights like health, housing, and education. Some rights, such as\nfreedom from torture, are non-limitable.\n5. Article 2 (Supremacy of the Constitution): Establishes the Constitution as the supreme law of\nthe land, rendering any inconsistent law void.\nGenerated by Legal Agent on 12/19/2025, 2:17:44 PM\nPrepared by: Legal Agent"
      ],
      "type": "application/pdf"
    }
  },
  "f54d0e89-1ba7-4160-ae6a-4eda8cf97daa": {
    "c3c9806d-7048-481f-b6d8-dac9e235f467": {
      "name": "CONSTITUTIONAL PETITION.pdf",
      "content": "IN THE HIGH COURT OF KENYA AT\nNAIROBI\nCONSTITUTIONAL AND JUDICIAL REVIEW DIVISION\nPETITION NO. 347 OF 2024\nBETWEEN\nMARY WANJIKU KAMAU .................................................... PETITIONER\nAND\nTHE COUNTY GOVERNMENT OF NAIROBI ................ 1ST RESPONDENT\nTHE ATTORNEY GENERAL ................................................ 2ND RESPONDENT\nTHE NAIROBI CITY COUNTY ASSEMBLY .................. 3RD RESPONDENT\nCONSTITUTIONAL PETITION\n(Under Articles 22, 23, 43, 165(3)(d) of the Constitution of Kenya, 2010 and Section 7 of the\nEnvironment and Land Court Act, 2011)\nA. PARTIES TO THE PETITION\n1. THE PETITIONER\n1.1 The Petitioner, MARY WANJIKU KAMAU, is an adult Kenyan citizen residing in Kibera,\nNairobi County, within the Republic of Kenya. She is a small-scale trader operating a\nvegetable stall at the Toi Market and a mother of three children.\n1.2 The Petitioner brings this Petition in her own interest and in the public interest pursuant\nto Article 22(1) and (2) of the Constitution, seeking to enforce fundamental rights and\nfreedoms guaranteed under the Bill of Rights.\n2. THE RESPONDENTS\n2.1 The 1st Respondent, THE COUNTY GOVERNMENT OF NAIROBI, is a County\nGovernment established under Article 176 of the Constitution with its principal offices at City\nHall, Nairobi. The 1st Respondent has constitutional and statutory obligations to deliver\nservices and protect the rights of residents within Nairobi County.\n2.2 The 2nd Respondent, THE ATTORNEY GENERAL, is the principal legal advisor to the\nGovernment of Kenya appointed under Article 156 of the Constitution and is sued in his\ncapacity as representative of the National Government.\n2.3 The 3rd Respondent, THE NAIROBI CITY COUNTY ASSEMBLY, is the legislative arm of\nthe County Government established under Article 176(2) of the Constitution with\nresponsibility for making laws for the County.\nB. BACKGROUND AND FACTS\n3. FACTUAL MATRIX\n3.1 The Petitioner has resided in Kibera, Nairobi County, for the past fifteen (15) years\ntogether with her three children aged 8, 11, and 14 years.\n3.2 Kibera is one of the largest informal settlements in Africa, home to approximately\n250,000 residents who live in conditions of extreme poverty and deprivation.\n3.3 On or about 15th March 2024, the 3rd Respondent passed The Nairobi City County\nInformal Settlements (Regulation and Control) Act, 2024 (\"the impugned Act\"), which was\nassented to by the County Governor on 28th March 2024.\n3.4 The impugned Act purports to regulate informal settlements within Nairobi County and\ncontains the following key provisions:\na) Section 7: Prohibits the construction, modification, or occupation of any structure in\ndesignated informal settlements without a permit from the County Government.\nb) Section 12: Empowers County Enforcement Officers to demolish any structure deemed\n\"illegal\" or \"non-compliant\" without a court order.\nc) Section 15: Imposes a mandatory permit fee of KES 50,000 for existing structures and\nKES 75,000 for new structures in informal settlements.\nd) Section 18: Provides that failure to obtain a permit within 90 days of the Act's\ncommencement renders the structure illegal and subject to immediate demolition.\ne) Section 21: Excludes any right to compensation for demolished structures.\n3.5 On 10th July 2024, the Petitioner received a notice from the 1st Respondent's\nEnforcement Department stating that her dwelling structure was in violation of the impugned\nAct and would be demolished on 25th July 2024 unless she obtained the requisite permit.\n3.6 The Petitioner attempted to apply for the permit but was unable to raise the KES 50,000\nfee, which represents approximately eight months of her income from her vegetable stall.\n3.7 On 25th July 2024, at approximately 6:00 AM, County Enforcement Officers,\naccompanied by police officers, arrived at Kibera and proceeded to demolish approximately\n200 structures, including the Petitioner's home.\n3.8 The demolition was conducted without any court order and without providing alternative\naccommodation or compensation to the affected residents.\n3.9 The Petitioner and her children have since been living in a temporary shelter constructed\nfrom salvaged materials and are exposed to the elements, with no access to adequate\nsanitation or security.\n3.10 The Petitioner has suffered significant psychological trauma, and her children have\nbeen unable to attend school regularly due to lack of stable housing.\nC. CONSTITUTIONAL AND LEGAL VIOLATIONS\n4. VIOLATION OF THE RIGHT TO ACCESSIBLE AND ADEQUATE\nHOUSING (ARTICLE 43(1)(b))\n4.1 Article 43(1)(b) of the Constitution guarantees every person \"the right to accessible and\nadequate housing, and to reasonable standards of sanitation.\"\n4.2 The impugned Act and the subsequent demolitions have directly violated this\nconstitutional right by:\na) Rendering the Petitioner and her family homeless without providing alternative\naccommodation;\nb) Imposing prohibitive permit fees that are beyond the means of informal settlement\nresidents, thereby making housing inaccessible;\nc) Failing to progressively realize the right to housing as required under Article 21(2) of the\nConstitution.\n4.3 In Satrose Ayuma & 11 Others v Registered Trustees of the Kenya Railways Staff\nRetirement Benefits Scheme & 2 Others [2016] eKLR, the Court of Appeal held that:\n\"The right to accessible and adequate housing under Article 43(1)(b) is not\nmerely a right to shelter but encompasses security of tenure, availability of\nservices, affordability, habitability, accessibility, location and cultural adequacy.\"\n4.4 The 1st Respondent has failed to provide any alternative housing or resettlement plan for\nthe affected residents, thereby violating the progressive realization principle.\n5. VIOLATION OF THE RIGHT TO HUMAN DIGNITY (ARTICLE 28)\n5.1 Article 28 of the Constitution provides that \"Every person has inherent dignity and the\nright to have that dignity respected and protected.\"\n5.2 The demolition of the Petitioner's home in the manner conducted, leaving her and her\nchildren exposed to the elements without shelter, has violated her fundamental right to\ndignity.\n5.3 In Francis Karioko Muruatetu & Another v Republic [2017] eKLR, the Supreme Court\nemphasized that:\n\"Human dignity is the foundation of all human rights and must be respected and\nprotected in all circumstances.\"\n5.4 The treatment of the Petitioner and other Kibera residents as though their homes and\nlives are disposable constitutes a grave affront to human dignity.\n6. VIOLATION OF THE RIGHT TO FAIR ADMINISTRATIVE ACTION\n(ARTICLE 47)\n6.1 Article 47 of the Constitution guarantees every person the right to administrative action\nthat is expeditious, efficient, lawful, reasonable, and procedurally fair.\n6.2 Section 12 of the impugned Act authorizes demolitions without a court order, thereby\nviolating the principles of fair administrative action by:\na) Failing to provide an opportunity for affected persons to be heard before demolition;\nb) Failing to provide reasons for the administrative decision to demolish;\nc) Denying affected persons the right to seek judicial review before the administrative action\nis executed.\n6.3 In Anarita Karimi Njeru v Republic [1979] eKLR, the Court of Appeal established the\nduty to afford a hearing before adverse administrative action, stating:\n\"The rules of natural justice require that a person be given notice and an\nopportunity to be heard before a decision affecting their rights is made.\"\n6.4 The 1st Respondent proceeded with demolitions without providing individual hearings or\nany meaningful opportunity for affected residents to present their cases.\n7. VIOLATION OF CHILDREN'S RIGHTS (ARTICLE 53)\n7.1 Article 53(1) of the Constitution provides that every child has the right to basic nutrition,\nshelter, basic health care, and education.\n7.2 The Petitioner's three children have been deprived of adequate shelter, their education\nhas been disrupted, and they have been exposed to health hazards as a result of the\ndemolition.\n7.3 In CMS & 12 Others v Attorney General & 2 Others [2020] eKLR, the High Court held\nthat:\n\"The State has an obligation to take positive measures to protect children's\nrights, and any action that exposes children to harm or deprivation violates\nArticle 53.\"\n7.4 The 1st Respondent failed to conduct any child impact assessment before undertaking\nthe demolitions, contrary to the principles in the Children Act, 2022.\n8. VIOLATION OF THE RIGHT TO PROPERTY (ARTICLE 40)\n8.1 Article 40(1) of the Constitution protects every person's right to own property either\nindividually or in association with others.\n8.2 Article 40(3) provides that the State shall not deprive a person of property without\ncompensation.\n8.3 The Petitioner had possessory rights over her dwelling and the improvements she made\nto it over fifteen years, which constitute property within the meaning of Article 40.\n8.4 In Mitubell Welfare Society v Kenya Airports Authority & 2 Others [2013] eKLR, the\nSupreme Court recognized that:\n\"Property rights extend beyond formal title to include possessory rights and\nlegitimate expectations of continued occupation.\"\n8.5 Section 21 of the impugned Act, which excludes compensation for demolished\nstructures, is unconstitutional and void as it violates Article 40(3).\n9. VIOLATION OF EQUALITY AND FREEDOM FROM DISCRIMINATION\n(ARTICLE 27)\n9.1 Article 27(1) provides that every person is equal before the law and has the right to equal\nprotection and equal benefit of the law.\n9.2 The impugned Act disproportionately affects poor and marginalized communities in\ninformal settlements while residents of formal housing areas are not subject to similar\narbitrary regulations or demolitions.\n9.3 The permit fees of KES 50,000-75,000 are discriminatory as they are unaffordable to\ninformal settlement residents whose average monthly income is approximately KES 6,000.\n9.4 In Federation of Women Lawyers (FIDA-K) & 5 Others v Attorney General &\nAnother [2019] eKLR, the Constitutional Court stated:\n\"Discrimination can occur through laws that are facially neutral but have a\ndisproportionate impact on marginalized groups.\"\n9.5 The impugned Act constitutes indirect discrimination against the poor and violates Article\n27.\n10. VIOLATION OF THE PRINCIPLE OF PUBLIC PARTICIPATION\n(ARTICLE 10 AND 196)\n10.1 Article 10(2)(a) of the Constitution establishes public participation as a national value\nand principle of governance.\n10.2 Article 196(1) specifically requires County Governments to conduct public participation\nin the exercise of their powers and performance of functions.\n10.3 The 3rd Respondent enacted the impugned Act without meaningful public participation,\nparticularly without consulting the residents of informal settlements who would be directly\naffected.\n10.4 In Doctors for Life International v Speaker of the National Assembly & Others\n(CCT 12/05) [2006] ZACC 11 (a persuasive South African authority frequently cited in\nKenya), the Constitutional Court held that:\n\"Public participation must be meaningful, and those most affected by legislation\nmust be given a reasonable opportunity to know about the issues and to have\nan adequate say.\"\n10.5 The 1st and 3rd Respondents failed to conduct any consultative forums in Kibera or\nother informal settlements before enacting the law.\nD. APPLICABLE LAW\n11. CONSTITUTIONAL PROVISIONS\n11.1 The following provisions of the Constitution of Kenya, 2010 are directly applicable:\nArticle 10 – National values and principles of governance, including human dignity, equity,\nsocial justice, and public participation.\nArticle 19(2) – The purpose of recognizing and protecting human rights and fundamental\nfreedoms is to preserve the dignity of individuals and communities.\nArticle 20 – Application of the Bill of Rights, particularly:\n● Article 20(2): The State and every State organ must respect, protect, promote and\nfulfill the rights in the Bill of Rights.\n● Article 20(4): The State must take legislative, policy and other measures, including\nsetting standards, to achieve the progressive realization of economic and social\nrights.\nArticle 21 – Implementation of rights and fundamental freedoms, which places an obligation\non the State to observe, respect, protect, promote and fulfill the rights in the Bill of Rights.\nArticle 22 – Enforcement of the Bill of Rights, which empowers any person to approach the\nHigh Court alleging that a right has been denied, violated or infringed.\nArticle 23 – Authority of courts to uphold and enforce the Bill of Rights, including granting\nappropriate relief and awarding compensation.\nArticle 27 – Equality and freedom from discrimination.\nArticle 28 – Right to human dignity.\nArticle 40 – Right to property, including protection against deprivation without compensation.\nArticle 43 – Economic and social rights, specifically:\n● Article 43(1)(b): The right to accessible and adequate housing and reasonable\nstandards of sanitation.\nArticle 47 – Right to fair administrative action.\nArticle 53 – Children's rights, including the right to shelter, education, and protection from\nharm.\nArticle 165(3)(d) – Jurisdiction of the High Court to hear constitutional matters.\nArticle 176 – Establishment and powers of County Governments.\nArticle 196 – Public participation in County Government functions.\n12. STATUTORY LAW\n12.1 The Fair Administrative Action Act, No. 4 of 2015\nSection 4 provides that administrative action must be:\n● Procedurally fair\n● Expeditious, efficient, lawful, reasonable and proportionate\nSection 6 requires that before making a decision affecting a person's rights, the administrator\nmust give notice and opportunity to make representations.\n12.2 The Children Act, 2022\nSection 9 places a duty on the State to progressively implement children's rights, including\nthe right to shelter.\n12.3 The Environment and Land Court Act, 2011\nSection 13 grants the Court jurisdiction over matters relating to environmental and land use\nplanning.\n13. INTERNATIONAL LAW\n13.1 Pursuant to Article 2(5) and (6) of the Constitution, general rules of international law\nand treaties ratified by Kenya form part of Kenyan law.\n13.2 International Covenant on Economic, Social and Cultural Rights (ICESCR)\nKenya ratified the ICESCR in 1972. Article 11(1) recognizes \"the right of everyone to an\nadequate standard of living for himself and his family, including adequate food, clothing and\nhousing.\"\nGeneral Comment No. 4 on the right to adequate housing emphasizes security of tenure,\nprotection against forced evictions, and the requirement of alternative accommodation.\n13.3 The African Charter on Human and Peoples' Rights\nKenya ratified the Charter in 1992. Article 14 protects the right to property, and Article 18\nrequires the State to ensure the protection of the family.\n13.4 Convention on the Rights of the Child (CRC)\nKenya ratified the CRC in 1990. Article 27 recognizes the right of every child to a standard of\nliving adequate for the child's physical, mental, spiritual, moral and social development.\nE. GROUNDS OF THE PETITION\n14. ILLEGALITY AND UNCONSTITUTIONALITY OF THE IMPUGNED ACT\n14.1 The impugned Act is unconstitutional, illegal, null and void ab initio for the following\nreasons:\na) It violates Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) It was enacted without public participation in violation of Articles 10 and 196 of the\nConstitution;\nc) It imposes disproportionate and discriminatory financial burdens on the poor;\nd) It authorizes arbitrary administrative action without judicial oversight;\ne) It excludes compensation in violation of Article 40(3);\nf) It fails to provide for alternative accommodation or progressive realization of housing\nrights.\n15. ILLEGALITY OF THE DEMOLITIONS\n15.1 The demolitions conducted on 25th July 2024 were illegal, unconstitutional and violated\nthe Petitioner's fundamental rights because:\na) They were conducted without court orders;\nb) No individual notice or hearing was provided to affected residents;\nc) No alternative accommodation was provided;\nd) No compensation was offered;\ne) The actions violated the principles of fair administrative action under Article 47;\nf) The demolitions exposed children to harm in violation of Article 53;\ng) The actions violated international law standards on forced evictions.\n16. FAILURE OF CONSTITUTIONAL OBLIGATIONS\n16.1 The Respondents have failed in their constitutional obligations under Article 21 to\nrespect, protect, promote and fulfill the rights in the Bill of Rights.\n16.2 The Respondents have failed to progressively realize the right to housing under Article\n43 and have instead taken retrogressive measures.\nF. RELIEFS SOUGHT\n17. WHEREFORE, the Petitioner humbly prays that this Honourable\nCourt be pleased to:\nDECLARATIONS\na) DECLARE that Sections 7, 12, 15, 18, and 21 of The Nairobi City County Informal\nSettlements (Regulation and Control) Act, 2024 are unconstitutional, null and void for\nviolating Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) DECLARE that the demolition of the Petitioner's dwelling on 25th July 2024 was illegal,\nunconstitutional and violated the Petitioner's rights under Articles 28, 40, 43, 47, and 53 of\nthe Constitution;\nc) DECLARE that the 1st and 3rd Respondents violated the Petitioner's right to public\nparticipation under Articles 10 and 196 of the Constitution by enacting the impugned Act\nwithout meaningful consultation with informal settlement residents;\nd) DECLARE that the Respondents have a constitutional obligation to progressively realize\nthe right to adequate housing under Article 43(1)(b) and must take positive measures to\nprovide housing for informal settlement residents;\nORDERS\ne) ORDER that the 1st Respondent immediately provide the Petitioner with alternative\nadequate temporary housing pending permanent resettlement;\nf) ORDER the 1st Respondent to compensate the Petitioner for the demolition of her\ndwelling and for the violation of her constitutional rights;\ng) ORDER the 1st and 3rd Respondents to develop, within six (6) months, a comprehensive\ninformal settlements upgrading policy that complies with constitutional requirements,\nincludes public participation, provides for security of tenure, and progressively realizes\nhousing rights;\nh) ORDER the 1st Respondent to immediately cease all further demolitions in informal\nsettlements until a constitutional policy framework is established;\ni) ISSUE a permanent injunction restraining the Respondents from implementing Sections 7,\n12, 15, 18, and 21 of the impugned Act;\nGENERAL RELIEF\nj) AWARD general and aggravated damages to the Petitioner for violation of her\nconstitutional rights;\nk) AWARD the costs of this Petition;\nl) GRANT any other relief that this Honourable Court may deem just and appropriate.\nG. CERTIFICATION OF URGENCY\n18. This Petition is urgent and requires immediate hearing because:\na) The Petitioner and her children are currently homeless and living in dehumanizing\nconditions;\nb) The children's health, safety, and education are at immediate risk;\nc) The 1st Respondent continues to conduct demolitions in informal settlements, affecting\nthousands of residents;\nd) The rainy season is approaching, which will further expose homeless residents to\nlife-threatening conditions;\ne) Irreparable harm is being suffered daily by the Petitioner and other affected persons.\nH. NOTICE TO THE ATTORNEY GENERAL\n19. Notice of this Constitutional Petition has been duly served upon the Attorney General\npursuant to Article 165(4) of the Constitution and Order 34 Rule 5 of the Constitution\nof Kenya (Protection of Rights and Fundamental Freedoms) Practice and Procedure\nRules, 2013.\nDATED at Nairobi this 15th day of August, 2024\nFILED by:\nKAMAU & ASSOCIATES ADVOCATES\nAdvocates for the Petitioner\nP.O. Box 12345-00100\nNairobi, Kenya\nTel: +254 712 345 678\nEmail: info@kamauadvocates.co.ke\nSIGNED:\nJAMES KAMAU MWANGI\nAdvocate for the Petitioner\nSCHEDULE OF DOCUMENTS\n1. Copy of the Petitioner's National Identity Card\n2. Copy of The Nairobi City County Informal Settlements (Regulation and Control) Act,\n2024\n3. Demolition Notice dated 10th July 2024\n4. Photographs of the Petitioner's demolished dwelling\n5. Photographs of current temporary shelter\n6. Medical report on the psychological impact on the Petitioner's children\n7. Affidavit of service on the Attorney General\n8. List of 200 affected households in Kibera\nSUPPORTING AFFIDAVIT\nI, MARY WANJIKU KAMAU, of P.O. Box XXXX, Nairobi in the Republic of Kenya, do\nhereby make oath and state as follows:\n1. THAT I am the Petitioner herein and am conversant with the facts of this case.\n2. THAT the facts deposed to in this Affidavit are true to the best of my knowledge,\ninformation and belief.\n3. THAT the contents of the foregoing Petition are true and accurate.\n4. THAT I have resided in Kibera for fifteen years and have made my dwelling there my\nfamily home.\n5. THAT I am a small-scale trader earning approximately KES 6,000 per month from\nselling vegetables at Toi Market.\n6. THAT I used my limited savings over many years to improve my dwelling with iron\nsheets, a proper door, and a small extension for my children.\n7. THAT on 10th July 2024, I received a demolition notice giving me 15 days to obtain a\npermit costing KES 50,000.\n8. THAT I attempted to raise the money but it was impossible as it represents more than\neight months of my income.\n9. THAT on 25th July 2024, County officers demolished my home without giving me a\nchance to remove my belongings or to be heard.\n10. THAT my children and I have suffered greatly since the demolition and are living in\ninhumane conditions.\n11. THAT I was never consulted before the Act was passed and neither were other\nresidents of Kibera.\n12. THAT I bring this Petition in good faith to protect my rights and those of my children.\nSWORN at Nairobi\nthis 15th day of August 2024\nBEFORE ME:\nCOMMISSIONER FOR OATHS\nMARY WANJIKU KAMAU\nPetitioner\nEND OF PETITION",
      "type": "application/pdf"
    }
  },
  "2a7ca157-3701-44ac-bd4b-d9a5fb47556d": {
    "99984316-b093-49ac-88f8-ba73406efaeb": {
      "name": "CONSTITUTIONAL PETITION.pdf",
      "content": "IN THE HIGH COURT OF KENYA AT\nNAIROBI\nCONSTITUTIONAL AND JUDICIAL REVIEW DIVISION\nPETITION NO. 347 OF 2024\nBETWEEN\nMARY WANJIKU KAMAU .................................................... PETITIONER\nAND\nTHE COUNTY GOVERNMENT OF NAIROBI ................ 1ST RESPONDENT\nTHE ATTORNEY GENERAL ................................................ 2ND RESPONDENT\nTHE NAIROBI CITY COUNTY ASSEMBLY .................. 3RD RESPONDENT\nCONSTITUTIONAL PETITION\n(Under Articles 22, 23, 43, 165(3)(d) of the Constitution of Kenya, 2010 and Section 7 of the\nEnvironment and Land Court Act, 2011)\nA. PARTIES TO THE PETITION\n1. THE PETITIONER\n1.1 The Petitioner, MARY WANJIKU KAMAU, is an adult Kenyan citizen residing in Kibera,\nNairobi County, within the Republic of Kenya. She is a small-scale trader operating a\nvegetable stall at the Toi Market and a mother of three children.\n1.2 The Petitioner brings this Petition in her own interest and in the public interest pursuant\nto Article 22(1) and (2) of the Constitution, seeking to enforce fundamental rights and\nfreedoms guaranteed under the Bill of Rights.\n2. THE RESPONDENTS\n2.1 The 1st Respondent, THE COUNTY GOVERNMENT OF NAIROBI, is a County\nGovernment established under Article 176 of the Constitution with its principal offices at City\nHall, Nairobi. The 1st Respondent has constitutional and statutory obligations to deliver\nservices and protect the rights of residents within Nairobi County.\n2.2 The 2nd Respondent, THE ATTORNEY GENERAL, is the principal legal advisor to the\nGovernment of Kenya appointed under Article 156 of the Constitution and is sued in his\ncapacity as representative of the National Government.\n2.3 The 3rd Respondent, THE NAIROBI CITY COUNTY ASSEMBLY, is the legislative arm of\nthe County Government established under Article 176(2) of the Constitution with\nresponsibility for making laws for the County.\nB. BACKGROUND AND FACTS\n3. FACTUAL MATRIX\n3.1 The Petitioner has resided in Kibera, Nairobi County, for the past fifteen (15) years\ntogether with her three children aged 8, 11, and 14 years.\n3.2 Kibera is one of the largest informal settlements in Africa, home to approximately\n250,000 residents who live in conditions of extreme poverty and deprivation.\n3.3 On or about 15th March 2024, the 3rd Respondent passed The Nairobi City County\nInformal Settlements (Regulation and Control) Act, 2024 (\"the impugned Act\"), which was\nassented to by the County Governor on 28th March 2024.\n3.4 The impugned Act purports to regulate informal settlements within Nairobi County and\ncontains the following key provisions:\na) Section 7: Prohibits the construction, modification, or occupation of any structure in\ndesignated informal settlements without a permit from the County Government.\nb) Section 12: Empowers County Enforcement Officers to demolish any structure deemed\n\"illegal\" or \"non-compliant\" without a court order.\nc) Section 15: Imposes a mandatory permit fee of KES 50,000 for existing structures and\nKES 75,000 for new structures in informal settlements.\nd) Section 18: Provides that failure to obtain a permit within 90 days of the Act's\ncommencement renders the structure illegal and subject to immediate demolition.\ne) Section 21: Excludes any right to compensation for demolished structures.\n3.5 On 10th July 2024, the Petitioner received a notice from the 1st Respondent's\nEnforcement Department stating that her dwelling structure was in violation of the impugned\nAct and would be demolished on 25th July 2024 unless she obtained the requisite permit.\n3.6 The Petitioner attempted to apply for the permit but was unable to raise the KES 50,000\nfee, which represents approximately eight months of her income from her vegetable stall.\n3.7 On 25th July 2024, at approximately 6:00 AM, County Enforcement Officers,\naccompanied by police officers, arrived at Kibera and proceeded to demolish approximately\n200 structures, including the Petitioner's home.\n3.8 The demolition was conducted without any court order and without providing alternative\naccommodation or compensation to the affected residents.\n3.9 The Petitioner and her children have since been living in a temporary shelter constructed\nfrom salvaged materials and are exposed to the elements, with no access to adequate\nsanitation or security.\n3.10 The Petitioner has suffered significant psychological trauma, and her children have\nbeen unable to attend school regularly due to lack of stable housing.\nC. CONSTITUTIONAL AND LEGAL VIOLATIONS\n4. VIOLATION OF THE RIGHT TO ACCESSIBLE AND ADEQUATE\nHOUSING (ARTICLE 43(1)(b))\n4.1 Article 43(1)(b) of the Constitution guarantees every person \"the right to accessible and\nadequate housing, and to reasonable standards of sanitation.\"\n4.2 The impugned Act and the subsequent demolitions have directly violated this\nconstitutional right by:\na) Rendering the Petitioner and her family homeless without providing alternative\naccommodation;\nb) Imposing prohibitive permit fees that are beyond the means of informal settlement\nresidents, thereby making housing inaccessible;\nc) Failing to progressively realize the right to housing as required under Article 21(2) of the\nConstitution.\n4.3 In Satrose Ayuma & 11 Others v Registered Trustees of the Kenya Railways Staff\nRetirement Benefits Scheme & 2 Others [2016] eKLR, the Court of Appeal held that:\n\"The right to accessible and adequate housing under Article 43(1)(b) is not\nmerely a right to shelter but encompasses security of tenure, availability of\nservices, affordability, habitability, accessibility, location and cultural adequacy.\"\n4.4 The 1st Respondent has failed to provide any alternative housing or resettlement plan for\nthe affected residents, thereby violating the progressive realization principle.\n5. VIOLATION OF THE RIGHT TO HUMAN DIGNITY (ARTICLE 28)\n5.1 Article 28 of the Constitution provides that \"Every person has inherent dignity and the\nright to have that dignity respected and protected.\"\n5.2 The demolition of the Petitioner's home in the manner conducted, leaving her and her\nchildren exposed to the elements without shelter, has violated her fundamental right to\ndignity.\n5.3 In Francis Karioko Muruatetu & Another v Republic [2017] eKLR, the Supreme Court\nemphasized that:\n\"Human dignity is the foundation of all human rights and must be respected and\nprotected in all circumstances.\"\n5.4 The treatment of the Petitioner and other Kibera residents as though their homes and\nlives are disposable constitutes a grave affront to human dignity.\n6. VIOLATION OF THE RIGHT TO FAIR ADMINISTRATIVE ACTION\n(ARTICLE 47)\n6.1 Article 47 of the Constitution guarantees every person the right to administrative action\nthat is expeditious, efficient, lawful, reasonable, and procedurally fair.\n6.2 Section 12 of the impugned Act authorizes demolitions without a court order, thereby\nviolating the principles of fair administrative action by:\na) Failing to provide an opportunity for affected persons to be heard before demolition;\nb) Failing to provide reasons for the administrative decision to demolish;\nc) Denying affected persons the right to seek judicial review before the administrative action\nis executed.\n6.3 In Anarita Karimi Njeru v Republic [1979] eKLR, the Court of Appeal established the\nduty to afford a hearing before adverse administrative action, stating:\n\"The rules of natural justice require that a person be given notice and an\nopportunity to be heard before a decision affecting their rights is made.\"\n6.4 The 1st Respondent proceeded with demolitions without providing individual hearings or\nany meaningful opportunity for affected residents to present their cases.\n7. VIOLATION OF CHILDREN'S RIGHTS (ARTICLE 53)\n7.1 Article 53(1) of the Constitution provides that every child has the right to basic nutrition,\nshelter, basic health care, and education.\n7.2 The Petitioner's three children have been deprived of adequate shelter, their education\nhas been disrupted, and they have been exposed to health hazards as a result of the\ndemolition.\n7.3 In CMS & 12 Others v Attorney General & 2 Others [2020] eKLR, the High Court held\nthat:\n\"The State has an obligation to take positive measures to protect children's\nrights, and any action that exposes children to harm or deprivation violates\nArticle 53.\"\n7.4 The 1st Respondent failed to conduct any child impact assessment before undertaking\nthe demolitions, contrary to the principles in the Children Act, 2022.\n8. VIOLATION OF THE RIGHT TO PROPERTY (ARTICLE 40)\n8.1 Article 40(1) of the Constitution protects every person's right to own property either\nindividually or in association with others.\n8.2 Article 40(3) provides that the State shall not deprive a person of property without\ncompensation.\n8.3 The Petitioner had possessory rights over her dwelling and the improvements she made\nto it over fifteen years, which constitute property within the meaning of Article 40.\n8.4 In Mitubell Welfare Society v Kenya Airports Authority & 2 Others [2013] eKLR, the\nSupreme Court recognized that:\n\"Property rights extend beyond formal title to include possessory rights and\nlegitimate expectations of continued occupation.\"\n8.5 Section 21 of the impugned Act, which excludes compensation for demolished\nstructures, is unconstitutional and void as it violates Article 40(3).\n9. VIOLATION OF EQUALITY AND FREEDOM FROM DISCRIMINATION\n(ARTICLE 27)\n9.1 Article 27(1) provides that every person is equal before the law and has the right to equal\nprotection and equal benefit of the law.\n9.2 The impugned Act disproportionately affects poor and marginalized communities in\ninformal settlements while residents of formal housing areas are not subject to similar\narbitrary regulations or demolitions.\n9.3 The permit fees of KES 50,000-75,000 are discriminatory as they are unaffordable to\ninformal settlement residents whose average monthly income is approximately KES 6,000.\n9.4 In Federation of Women Lawyers (FIDA-K) & 5 Others v Attorney General &\nAnother [2019] eKLR, the Constitutional Court stated:\n\"Discrimination can occur through laws that are facially neutral but have a\ndisproportionate impact on marginalized groups.\"\n9.5 The impugned Act constitutes indirect discrimination against the poor and violates Article\n27.\n10. VIOLATION OF THE PRINCIPLE OF PUBLIC PARTICIPATION\n(ARTICLE 10 AND 196)\n10.1 Article 10(2)(a) of the Constitution establishes public participation as a national value\nand principle of governance.\n10.2 Article 196(1) specifically requires County Governments to conduct public participation\nin the exercise of their powers and performance of functions.\n10.3 The 3rd Respondent enacted the impugned Act without meaningful public participation,\nparticularly without consulting the residents of informal settlements who would be directly\naffected.\n10.4 In Doctors for Life International v Speaker of the National Assembly & Others\n(CCT 12/05) [2006] ZACC 11 (a persuasive South African authority frequently cited in\nKenya), the Constitutional Court held that:\n\"Public participation must be meaningful, and those most affected by legislation\nmust be given a reasonable opportunity to know about the issues and to have\nan adequate say.\"\n10.5 The 1st and 3rd Respondents failed to conduct any consultative forums in Kibera or\nother informal settlements before enacting the law.\nD. APPLICABLE LAW\n11. CONSTITUTIONAL PROVISIONS\n11.1 The following provisions of the Constitution of Kenya, 2010 are directly applicable:\nArticle 10 – National values and principles of governance, including human dignity, equity,\nsocial justice, and public participation.\nArticle 19(2) – The purpose of recognizing and protecting human rights and fundamental\nfreedoms is to preserve the dignity of individuals and communities.\nArticle 20 – Application of the Bill of Rights, particularly:\n● Article 20(2): The State and every State organ must respect, protect, promote and\nfulfill the rights in the Bill of Rights.\n● Article 20(4): The State must take legislative, policy and other measures, including\nsetting standards, to achieve the progressive realization of economic and social\nrights.\nArticle 21 – Implementation of rights and fundamental freedoms, which places an obligation\non the State to observe, respect, protect, promote and fulfill the rights in the Bill of Rights.\nArticle 22 – Enforcement of the Bill of Rights, which empowers any person to approach the\nHigh Court alleging that a right has been denied, violated or infringed.\nArticle 23 – Authority of courts to uphold and enforce the Bill of Rights, including granting\nappropriate relief and awarding compensation.\nArticle 27 – Equality and freedom from discrimination.\nArticle 28 – Right to human dignity.\nArticle 40 – Right to property, including protection against deprivation without compensation.\nArticle 43 – Economic and social rights, specifically:\n● Article 43(1)(b): The right to accessible and adequate housing and reasonable\nstandards of sanitation.\nArticle 47 – Right to fair administrative action.\nArticle 53 – Children's rights, including the right to shelter, education, and protection from\nharm.\nArticle 165(3)(d) – Jurisdiction of the High Court to hear constitutional matters.\nArticle 176 – Establishment and powers of County Governments.\nArticle 196 – Public participation in County Government functions.\n12. STATUTORY LAW\n12.1 The Fair Administrative Action Act, No. 4 of 2015\nSection 4 provides that administrative action must be:\n● Procedurally fair\n● Expeditious, efficient, lawful, reasonable and proportionate\nSection 6 requires that before making a decision affecting a person's rights, the administrator\nmust give notice and opportunity to make representations.\n12.2 The Children Act, 2022\nSection 9 places a duty on the State to progressively implement children's rights, including\nthe right to shelter.\n12.3 The Environment and Land Court Act, 2011\nSection 13 grants the Court jurisdiction over matters relating to environmental and land use\nplanning.\n13. INTERNATIONAL LAW\n13.1 Pursuant to Article 2(5) and (6) of the Constitution, general rules of international law\nand treaties ratified by Kenya form part of Kenyan law.\n13.2 International Covenant on Economic, Social and Cultural Rights (ICESCR)\nKenya ratified the ICESCR in 1972. Article 11(1) recognizes \"the right of everyone to an\nadequate standard of living for himself and his family, including adequate food, clothing and\nhousing.\"\nGeneral Comment No. 4 on the right to adequate housing emphasizes security of tenure,\nprotection against forced evictions, and the requirement of alternative accommodation.\n13.3 The African Charter on Human and Peoples' Rights\nKenya ratified the Charter in 1992. Article 14 protects the right to property, and Article 18\nrequires the State to ensure the protection of the family.\n13.4 Convention on the Rights of the Child (CRC)\nKenya ratified the CRC in 1990. Article 27 recognizes the right of every child to a standard of\nliving adequate for the child's physical, mental, spiritual, moral and social development.\nE. GROUNDS OF THE PETITION\n14. ILLEGALITY AND UNCONSTITUTIONALITY OF THE IMPUGNED ACT\n14.1 The impugned Act is unconstitutional, illegal, null and void ab initio for the following\nreasons:\na) It violates Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) It was enacted without public participation in violation of Articles 10 and 196 of the\nConstitution;\nc) It imposes disproportionate and discriminatory financial burdens on the poor;\nd) It authorizes arbitrary administrative action without judicial oversight;\ne) It excludes compensation in violation of Article 40(3);\nf) It fails to provide for alternative accommodation or progressive realization of housing\nrights.\n15. ILLEGALITY OF THE DEMOLITIONS\n15.1 The demolitions conducted on 25th July 2024 were illegal, unconstitutional and violated\nthe Petitioner's fundamental rights because:\na) They were conducted without court orders;\nb) No individual notice or hearing was provided to affected residents;\nc) No alternative accommodation was provided;\nd) No compensation was offered;\ne) The actions violated the principles of fair administrative action under Article 47;\nf) The demolitions exposed children to harm in violation of Article 53;\ng) The actions violated international law standards on forced evictions.\n16. FAILURE OF CONSTITUTIONAL OBLIGATIONS\n16.1 The Respondents have failed in their constitutional obligations under Article 21 to\nrespect, protect, promote and fulfill the rights in the Bill of Rights.\n16.2 The Respondents have failed to progressively realize the right to housing under Article\n43 and have instead taken retrogressive measures.\nF. RELIEFS SOUGHT\n17. WHEREFORE, the Petitioner humbly prays that this Honourable\nCourt be pleased to:\nDECLARATIONS\na) DECLARE that Sections 7, 12, 15, 18, and 21 of The Nairobi City County Informal\nSettlements (Regulation and Control) Act, 2024 are unconstitutional, null and void for\nviolating Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) DECLARE that the demolition of the Petitioner's dwelling on 25th July 2024 was illegal,\nunconstitutional and violated the Petitioner's rights under Articles 28, 40, 43, 47, and 53 of\nthe Constitution;\nc) DECLARE that the 1st and 3rd Respondents violated the Petitioner's right to public\nparticipation under Articles 10 and 196 of the Constitution by enacting the impugned Act\nwithout meaningful consultation with informal settlement residents;\nd) DECLARE that the Respondents have a constitutional obligation to progressively realize\nthe right to adequate housing under Article 43(1)(b) and must take positive measures to\nprovide housing for informal settlement residents;\nORDERS\ne) ORDER that the 1st Respondent immediately provide the Petitioner with alternative\nadequate temporary housing pending permanent resettlement;\nf) ORDER the 1st Respondent to compensate the Petitioner for the demolition of her\ndwelling and for the violation of her constitutional rights;\ng) ORDER the 1st and 3rd Respondents to develop, within six (6) months, a comprehensive\ninformal settlements upgrading policy that complies with constitutional requirements,\nincludes public participation, provides for security of tenure, and progressively realizes\nhousing rights;\nh) ORDER the 1st Respondent to immediately cease all further demolitions in informal\nsettlements until a constitutional policy framework is established;\ni) ISSUE a permanent injunction restraining the Respondents from implementing Sections 7,\n12, 15, 18, and 21 of the impugned Act;\nGENERAL RELIEF\nj) AWARD general and aggravated damages to the Petitioner for violation of her\nconstitutional rights;\nk) AWARD the costs of this Petition;\nl) GRANT any other relief that this Honourable Court may deem just and appropriate.\nG. CERTIFICATION OF URGENCY\n18. This Petition is urgent and requires immediate hearing because:\na) The Petitioner and her children are currently homeless and living in dehumanizing\nconditions;\nb) The children's health, safety, and education are at immediate risk;\nc) The 1st Respondent continues to conduct demolitions in informal settlements, affecting\nthousands of residents;\nd) The rainy season is approaching, which will further expose homeless residents to\nlife-threatening conditions;\ne) Irreparable harm is being suffered daily by the Petitioner and other affected persons.\nH. NOTICE TO THE ATTORNEY GENERAL\n19. Notice of this Constitutional Petition has been duly served upon the Attorney General\npursuant to Article 165(4) of the Constitution and Order 34 Rule 5 of the Constitution\nof Kenya (Protection of Rights and Fundamental Freedoms) Practice and Procedure\nRules, 2013.\nDATED at Nairobi this 15th day of August, 2024\nFILED by:\nKAMAU & ASSOCIATES ADVOCATES\nAdvocates for the Petitioner\nP.O. Box 12345-00100\nNairobi, Kenya\nTel: +254 712 345 678\nEmail: info@kamauadvocates.co.ke\nSIGNED:\nJAMES KAMAU MWANGI\nAdvocate for the Petitioner\nSCHEDULE OF DOCUMENTS\n1. Copy of the Petitioner's National Identity Card\n2. Copy of The Nairobi City County Informal Settlements (Regulation and Control) Act,\n2024\n3. Demolition Notice dated 10th July 2024\n4. Photographs of the Petitioner's demolished dwelling\n5. Photographs of current temporary shelter\n6. Medical report on the psychological impact on the Petitioner's children\n7. Affidavit of service on the Attorney General\n8. List of 200 affected households in Kibera\nSUPPORTING AFFIDAVIT\nI, MARY WANJIKU KAMAU, of P.O. Box XXXX, Nairobi in the Republic of Kenya, do\nhereby make oath and state as follows:\n1. THAT I am the Petitioner herein and am conversant with the facts of this case.\n2. THAT the facts deposed to in this Affidavit are true to the best of my knowledge,\ninformation and belief.\n3. THAT the contents of the foregoing Petition are true and accurate.\n4. THAT I have resided in Kibera for fifteen years and have made my dwelling there my\nfamily home.\n5. THAT I am a small-scale trader earning approximately KES 6,000 per month from\nselling vegetables at Toi Market.\n6. THAT I used my limited savings over many years to improve my dwelling with iron\nsheets, a proper door, and a small extension for my children.\n7. THAT on 10th July 2024, I received a demolition notice giving me 15 days to obtain a\npermit costing KES 50,000.\n8. THAT I attempted to raise the money but it was impossible as it represents more than\neight months of my income.\n9. THAT on 25th July 2024, County officers demolished my home without giving me a\nchance to remove my belongings or to be heard.\n10. THAT my children and I have suffered greatly since the demolition and are living in\ninhumane conditions.\n11. THAT I was never consulted before the Act was passed and neither were other\nresidents of Kibera.\n12. THAT I bring this Petition in good faith to protect my rights and those of my children.\nSWORN at Nairobi\nthis 15th day of August 2024\nBEFORE ME:\nCOMMISSIONER FOR OATHS\nMARY WANJIKU KAMAU\nPetitioner\nEND OF PETITION",
      "type": "application/pdf"
    },
    "summary_Key_Readings_on_Housing_Rights_and_Demolitions_in__2025-12-20T10-52-16.pdf": {
      "name": "summary_Key_Readings_on_Housing_Rights_and_Demolitions_in__2025-12-20T10-52-16.pdf",
      "content": "To better understand the legal basis for Mary Wanjiku Kamau's petition, you should focus on the following:\n\n1.  **Article 43(1)(b) of the Constitution of Kenya, 2010:** This is the foundational legal provision guaranteeing the right to accessible and adequate housing. It's crucial to understand the language and scope of this article.\n\n2.  **Mitu-Bell Welfare Society v Kenya Airports Authority & Others [2021] eKLR:** This Supreme Court case is a key precedent. It established that demolishing informal homes without prior notice, consultation, or resettlement plans infringes upon the right to housing and linked this right to dignity, privacy, and procedural fairness. The ruling emphasizes the state's obligation to provide alternatives or compensation in such situations.\n\n3.  **General Comment No. 7 of the UN Committee on Economic, Social and Cultural Rights:** While an international standard, Kenyan courts often refer to this comment. It outlines that evictions should only be a last resort, with legal remedies and alternatives, and without disproportionate impact on marginalized groups.\n\nReading these documents will provide a solid understanding of the constitutional protections against forced evictions and the judicial interpretation of the right to housing in Kenya, particularly in the context of informal settlements.",
      "type": "generated"
    }
  },
  "c3d0080e-e6e7-4cfb-adfb-7ded91280838": {
    "f4ef317c-573e-4750-8b88-b52a6e2f5b4c": {
      "name": "CONSTITUTIONAL PETITION.pdf",
      "content": "IN THE HIGH COURT OF KENYA AT\nNAIROBI\nCONSTITUTIONAL AND JUDICIAL REVIEW DIVISION\nPETITION NO. 347 OF 2024\nBETWEEN\nMARY WANJIKU KAMAU .................................................... PETITIONER\nAND\nTHE COUNTY GOVERNMENT OF NAIROBI ................ 1ST RESPONDENT\nTHE ATTORNEY GENERAL ................................................ 2ND RESPONDENT\nTHE NAIROBI CITY COUNTY ASSEMBLY .................. 3RD RESPONDENT\nCONSTITUTIONAL PETITION\n(Under Articles 22, 23, 43, 165(3)(d) of the Constitution of Kenya, 2010 and Section 7 of the\nEnvironment and Land Court Act, 2011)\nA. PARTIES TO THE PETITION\n1. THE PETITIONER\n1.1 The Petitioner, MARY WANJIKU KAMAU, is an adult Kenyan citizen residing in Kibera,\nNairobi County, within the Republic of Kenya. She is a small-scale trader operating a\nvegetable stall at the Toi Market and a mother of three children.\n1.2 The Petitioner brings this Petition in her own interest and in the public interest pursuant\nto Article 22(1) and (2) of the Constitution, seeking to enforce fundamental rights and\nfreedoms guaranteed under the Bill of Rights.\n2. THE RESPONDENTS\n2.1 The 1st Respondent, THE COUNTY GOVERNMENT OF NAIROBI, is a County\nGovernment established under Article 176 of the Constitution with its principal offices at City\nHall, Nairobi. The 1st Respondent has constitutional and statutory obligations to deliver\nservices and protect the rights of residents within Nairobi County.\n2.2 The 2nd Respondent, THE ATTORNEY GENERAL, is the principal legal advisor to the\nGovernment of Kenya appointed under Article 156 of the Constitution and is sued in his\ncapacity as representative of the National Government.\n2.3 The 3rd Respondent, THE NAIROBI CITY COUNTY ASSEMBLY, is the legislative arm of\nthe County Government established under Article 176(2) of the Constitution with\nresponsibility for making laws for the County.\nB. BACKGROUND AND FACTS\n3. FACTUAL MATRIX\n3.1 The Petitioner has resided in Kibera, Nairobi County, for the past fifteen (15) years\ntogether with her three children aged 8, 11, and 14 years.\n3.2 Kibera is one of the largest informal settlements in Africa, home to approximately\n250,000 residents who live in conditions of extreme poverty and deprivation.\n3.3 On or about 15th March 2024, the 3rd Respondent passed The Nairobi City County\nInformal Settlements (Regulation and Control) Act, 2024 (\"the impugned Act\"), which was\nassented to by the County Governor on 28th March 2024.\n3.4 The impugned Act purports to regulate informal settlements within Nairobi County and\ncontains the following key provisions:\na) Section 7: Prohibits the construction, modification, or occupation of any structure in\ndesignated informal settlements without a permit from the County Government.\nb) Section 12: Empowers County Enforcement Officers to demolish any structure deemed\n\"illegal\" or \"non-compliant\" without a court order.\nc) Section 15: Imposes a mandatory permit fee of KES 50,000 for existing structures and\nKES 75,000 for new structures in informal settlements.\nd) Section 18: Provides that failure to obtain a permit within 90 days of the Act's\ncommencement renders the structure illegal and subject to immediate demolition.\ne) Section 21: Excludes any right to compensation for demolished structures.\n3.5 On 10th July 2024, the Petitioner received a notice from the 1st Respondent's\nEnforcement Department stating that her dwelling structure was in violation of the impugned\nAct and would be demolished on 25th July 2024 unless she obtained the requisite permit.\n3.6 The Petitioner attempted to apply for the permit but was unable to raise the KES 50,000\nfee, which represents approximately eight months of her income from her vegetable stall.\n3.7 On 25th July 2024, at approximately 6:00 AM, County Enforcement Officers,\naccompanied by police officers, arrived at Kibera and proceeded to demolish approximately\n200 structures, including the Petitioner's home.\n3.8 The demolition was conducted without any court order and without providing alternative\naccommodation or compensation to the affected residents.\n3.9 The Petitioner and her children have since been living in a temporary shelter constructed\nfrom salvaged materials and are exposed to the elements, with no access to adequate\nsanitation or security.\n3.10 The Petitioner has suffered significant psychological trauma, and her children have\nbeen unable to attend school regularly due to lack of stable housing.\nC. CONSTITUTIONAL AND LEGAL VIOLATIONS\n4. VIOLATION OF THE RIGHT TO ACCESSIBLE AND ADEQUATE\nHOUSING (ARTICLE 43(1)(b))\n4.1 Article 43(1)(b) of the Constitution guarantees every person \"the right to accessible and\nadequate housing, and to reasonable standards of sanitation.\"\n4.2 The impugned Act and the subsequent demolitions have directly violated this\nconstitutional right by:\na) Rendering the Petitioner and her family homeless without providing alternative\naccommodation;\nb) Imposing prohibitive permit fees that are beyond the means of informal settlement\nresidents, thereby making housing inaccessible;\nc) Failing to progressively realize the right to housing as required under Article 21(2) of the\nConstitution.\n4.3 In Satrose Ayuma & 11 Others v Registered Trustees of the Kenya Railways Staff\nRetirement Benefits Scheme & 2 Others [2016] eKLR, the Court of Appeal held that:\n\"The right to accessible and adequate housing under Article 43(1)(b) is not\nmerely a right to shelter but encompasses security of tenure, availability of\nservices, affordability, habitability, accessibility, location and cultural adequacy.\"\n4.4 The 1st Respondent has failed to provide any alternative housing or resettlement plan for\nthe affected residents, thereby violating the progressive realization principle.\n5. VIOLATION OF THE RIGHT TO HUMAN DIGNITY (ARTICLE 28)\n5.1 Article 28 of the Constitution provides that \"Every person has inherent dignity and the\nright to have that dignity respected and protected.\"\n5.2 The demolition of the Petitioner's home in the manner conducted, leaving her and her\nchildren exposed to the elements without shelter, has violated her fundamental right to\ndignity.\n5.3 In Francis Karioko Muruatetu & Another v Republic [2017] eKLR, the Supreme Court\nemphasized that:\n\"Human dignity is the foundation of all human rights and must be respected and\nprotected in all circumstances.\"\n5.4 The treatment of the Petitioner and other Kibera residents as though their homes and\nlives are disposable constitutes a grave affront to human dignity.\n6. VIOLATION OF THE RIGHT TO FAIR ADMINISTRATIVE ACTION\n(ARTICLE 47)\n6.1 Article 47 of the Constitution guarantees every person the right to administrative action\nthat is expeditious, efficient, lawful, reasonable, and procedurally fair.\n6.2 Section 12 of the impugned Act authorizes demolitions without a court order, thereby\nviolating the principles of fair administrative action by:\na) Failing to provide an opportunity for affected persons to be heard before demolition;\nb) Failing to provide reasons for the administrative decision to demolish;\nc) Denying affected persons the right to seek judicial review before the administrative action\nis executed.\n6.3 In Anarita Karimi Njeru v Republic [1979] eKLR, the Court of Appeal established the\nduty to afford a hearing before adverse administrative action, stating:\n\"The rules of natural justice require that a person be given notice and an\nopportunity to be heard before a decision affecting their rights is made.\"\n6.4 The 1st Respondent proceeded with demolitions without providing individual hearings or\nany meaningful opportunity for affected residents to present their cases.\n7. VIOLATION OF CHILDREN'S RIGHTS (ARTICLE 53)\n7.1 Article 53(1) of the Constitution provides that every child has the right to basic nutrition,\nshelter, basic health care, and education.\n7.2 The Petitioner's three children have been deprived of adequate shelter, their education\nhas been disrupted, and they have been exposed to health hazards as a result of the\ndemolition.\n7.3 In CMS & 12 Others v Attorney General & 2 Others [2020] eKLR, the High Court held\nthat:\n\"The State has an obligation to take positive measures to protect children's\nrights, and any action that exposes children to harm or deprivation violates\nArticle 53.\"\n7.4 The 1st Respondent failed to conduct any child impact assessment before undertaking\nthe demolitions, contrary to the principles in the Children Act, 2022.\n8. VIOLATION OF THE RIGHT TO PROPERTY (ARTICLE 40)\n8.1 Article 40(1) of the Constitution protects every person's right to own property either\nindividually or in association with others.\n8.2 Article 40(3) provides that the State shall not deprive a person of property without\ncompensation.\n8.3 The Petitioner had possessory rights over her dwelling and the improvements she made\nto it over fifteen years, which constitute property within the meaning of Article 40.\n8.4 In Mitubell Welfare Society v Kenya Airports Authority & 2 Others [2013] eKLR, the\nSupreme Court recognized that:\n\"Property rights extend beyond formal title to include possessory rights and\nlegitimate expectations of continued occupation.\"\n8.5 Section 21 of the impugned Act, which excludes compensation for demolished\nstructures, is unconstitutional and void as it violates Article 40(3).\n9. VIOLATION OF EQUALITY AND FREEDOM FROM DISCRIMINATION\n(ARTICLE 27)\n9.1 Article 27(1) provides that every person is equal before the law and has the right to equal\nprotection and equal benefit of the law.\n9.2 The impugned Act disproportionately affects poor and marginalized communities in\ninformal settlements while residents of formal housing areas are not subject to similar\narbitrary regulations or demolitions.\n9.3 The permit fees of KES 50,000-75,000 are discriminatory as they are unaffordable to\ninformal settlement residents whose average monthly income is approximately KES 6,000.\n9.4 In Federation of Women Lawyers (FIDA-K) & 5 Others v Attorney General &\nAnother [2019] eKLR, the Constitutional Court stated:\n\"Discrimination can occur through laws that are facially neutral but have a\ndisproportionate impact on marginalized groups.\"\n9.5 The impugned Act constitutes indirect discrimination against the poor and violates Article\n27.\n10. VIOLATION OF THE PRINCIPLE OF PUBLIC PARTICIPATION\n(ARTICLE 10 AND 196)\n10.1 Article 10(2)(a) of the Constitution establishes public participation as a national value\nand principle of governance.\n10.2 Article 196(1) specifically requires County Governments to conduct public participation\nin the exercise of their powers and performance of functions.\n10.3 The 3rd Respondent enacted the impugned Act without meaningful public participation,\nparticularly without consulting the residents of informal settlements who would be directly\naffected.\n10.4 In Doctors for Life International v Speaker of the National Assembly & Others\n(CCT 12/05) [2006] ZACC 11 (a persuasive South African authority frequently cited in\nKenya), the Constitutional Court held that:\n\"Public participation must be meaningful, and those most affected by legislation\nmust be given a reasonable opportunity to know about the issues and to have\nan adequate say.\"\n10.5 The 1st and 3rd Respondents failed to conduct any consultative forums in Kibera or\nother informal settlements before enacting the law.\nD. APPLICABLE LAW\n11. CONSTITUTIONAL PROVISIONS\n11.1 The following provisions of the Constitution of Kenya, 2010 are directly applicable:\nArticle 10 – National values and principles of governance, including human dignity, equity,\nsocial justice, and public participation.\nArticle 19(2) – The purpose of recognizing and protecting human rights and fundamental\nfreedoms is to preserve the dignity of individuals and communities.\nArticle 20 – Application of the Bill of Rights, particularly:\n● Article 20(2): The State and every State organ must respect, protect, promote and\nfulfill the rights in the Bill of Rights.\n● Article 20(4): The State must take legislative, policy and other measures, including\nsetting standards, to achieve the progressive realization of economic and social\nrights.\nArticle 21 – Implementation of rights and fundamental freedoms, which places an obligation\non the State to observe, respect, protect, promote and fulfill the rights in the Bill of Rights.\nArticle 22 – Enforcement of the Bill of Rights, which empowers any person to approach the\nHigh Court alleging that a right has been denied, violated or infringed.\nArticle 23 – Authority of courts to uphold and enforce the Bill of Rights, including granting\nappropriate relief and awarding compensation.\nArticle 27 – Equality and freedom from discrimination.\nArticle 28 – Right to human dignity.\nArticle 40 – Right to property, including protection against deprivation without compensation.\nArticle 43 – Economic and social rights, specifically:\n● Article 43(1)(b): The right to accessible and adequate housing and reasonable\nstandards of sanitation.\nArticle 47 – Right to fair administrative action.\nArticle 53 – Children's rights, including the right to shelter, education, and protection from\nharm.\nArticle 165(3)(d) – Jurisdiction of the High Court to hear constitutional matters.\nArticle 176 – Establishment and powers of County Governments.\nArticle 196 – Public participation in County Government functions.\n12. STATUTORY LAW\n12.1 The Fair Administrative Action Act, No. 4 of 2015\nSection 4 provides that administrative action must be:\n● Procedurally fair\n● Expeditious, efficient, lawful, reasonable and proportionate\nSection 6 requires that before making a decision affecting a person's rights, the administrator\nmust give notice and opportunity to make representations.\n12.2 The Children Act, 2022\nSection 9 places a duty on the State to progressively implement children's rights, including\nthe right to shelter.\n12.3 The Environment and Land Court Act, 2011\nSection 13 grants the Court jurisdiction over matters relating to environmental and land use\nplanning.\n13. INTERNATIONAL LAW\n13.1 Pursuant to Article 2(5) and (6) of the Constitution, general rules of international law\nand treaties ratified by Kenya form part of Kenyan law.\n13.2 International Covenant on Economic, Social and Cultural Rights (ICESCR)\nKenya ratified the ICESCR in 1972. Article 11(1) recognizes \"the right of everyone to an\nadequate standard of living for himself and his family, including adequate food, clothing and\nhousing.\"\nGeneral Comment No. 4 on the right to adequate housing emphasizes security of tenure,\nprotection against forced evictions, and the requirement of alternative accommodation.\n13.3 The African Charter on Human and Peoples' Rights\nKenya ratified the Charter in 1992. Article 14 protects the right to property, and Article 18\nrequires the State to ensure the protection of the family.\n13.4 Convention on the Rights of the Child (CRC)\nKenya ratified the CRC in 1990. Article 27 recognizes the right of every child to a standard of\nliving adequate for the child's physical, mental, spiritual, moral and social development.\nE. GROUNDS OF THE PETITION\n14. ILLEGALITY AND UNCONSTITUTIONALITY OF THE IMPUGNED ACT\n14.1 The impugned Act is unconstitutional, illegal, null and void ab initio for the following\nreasons:\na) It violates Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) It was enacted without public participation in violation of Articles 10 and 196 of the\nConstitution;\nc) It imposes disproportionate and discriminatory financial burdens on the poor;\nd) It authorizes arbitrary administrative action without judicial oversight;\ne) It excludes compensation in violation of Article 40(3);\nf) It fails to provide for alternative accommodation or progressive realization of housing\nrights.\n15. ILLEGALITY OF THE DEMOLITIONS\n15.1 The demolitions conducted on 25th July 2024 were illegal, unconstitutional and violated\nthe Petitioner's fundamental rights because:\na) They were conducted without court orders;\nb) No individual notice or hearing was provided to affected residents;\nc) No alternative accommodation was provided;\nd) No compensation was offered;\ne) The actions violated the principles of fair administrative action under Article 47;\nf) The demolitions exposed children to harm in violation of Article 53;\ng) The actions violated international law standards on forced evictions.\n16. FAILURE OF CONSTITUTIONAL OBLIGATIONS\n16.1 The Respondents have failed in their constitutional obligations under Article 21 to\nrespect, protect, promote and fulfill the rights in the Bill of Rights.\n16.2 The Respondents have failed to progressively realize the right to housing under Article\n43 and have instead taken retrogressive measures.\nF. RELIEFS SOUGHT\n17. WHEREFORE, the Petitioner humbly prays that this Honourable\nCourt be pleased to:\nDECLARATIONS\na) DECLARE that Sections 7, 12, 15, 18, and 21 of The Nairobi City County Informal\nSettlements (Regulation and Control) Act, 2024 are unconstitutional, null and void for\nviolating Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) DECLARE that the demolition of the Petitioner's dwelling on 25th July 2024 was illegal,\nunconstitutional and violated the Petitioner's rights under Articles 28, 40, 43, 47, and 53 of\nthe Constitution;\nc) DECLARE that the 1st and 3rd Respondents violated the Petitioner's right to public\nparticipation under Articles 10 and 196 of the Constitution by enacting the impugned Act\nwithout meaningful consultation with informal settlement residents;\nd) DECLARE that the Respondents have a constitutional obligation to progressively realize\nthe right to adequate housing under Article 43(1)(b) and must take positive measures to\nprovide housing for informal settlement residents;\nORDERS\ne) ORDER that the 1st Respondent immediately provide the Petitioner with alternative\nadequate temporary housing pending permanent resettlement;\nf) ORDER the 1st Respondent to compensate the Petitioner for the demolition of her\ndwelling and for the violation of her constitutional rights;\ng) ORDER the 1st and 3rd Respondents to develop, within six (6) months, a comprehensive\ninformal settlements upgrading policy that complies with constitutional requirements,\nincludes public participation, provides for security of tenure, and progressively realizes\nhousing rights;\nh) ORDER the 1st Respondent to immediately cease all further demolitions in informal\nsettlements until a constitutional policy framework is established;\ni) ISSUE a permanent injunction restraining the Respondents from implementing Sections 7,\n12, 15, 18, and 21 of the impugned Act;\nGENERAL RELIEF\nj) AWARD general and aggravated damages to the Petitioner for violation of her\nconstitutional rights;\nk) AWARD the costs of this Petition;\nl) GRANT any other relief that this Honourable Court may deem just and appropriate.\nG. CERTIFICATION OF URGENCY\n18. This Petition is urgent and requires immediate hearing because:\na) The Petitioner and her children are currently homeless and living in dehumanizing\nconditions;\nb) The children's health, safety, and education are at immediate risk;\nc) The 1st Respondent continues to conduct demolitions in informal settlements, affecting\nthousands of residents;\nd) The rainy season is approaching, which will further expose homeless residents to\nlife-threatening conditions;\ne) Irreparable harm is being suffered daily by the Petitioner and other affected persons.\nH. NOTICE TO THE ATTORNEY GENERAL\n19. Notice of this Constitutional Petition has been duly served upon the Attorney General\npursuant to Article 165(4) of the Constitution and Order 34 Rule 5 of the Constitution\nof Kenya (Protection of Rights and Fundamental Freedoms) Practice and Procedure\nRules, 2013.\nDATED at Nairobi this 15th day of August, 2024\nFILED by:\nKAMAU & ASSOCIATES ADVOCATES\nAdvocates for the Petitioner\nP.O. Box 12345-00100\nNairobi, Kenya\nTel: +254 712 345 678\nEmail: info@kamauadvocates.co.ke\nSIGNED:\nJAMES KAMAU MWANGI\nAdvocate for the Petitioner\nSCHEDULE OF DOCUMENTS\n1. Copy of the Petitioner's National Identity Card\n2. Copy of The Nairobi City County Informal Settlements (Regulation and Control) Act,\n2024\n3. Demolition Notice dated 10th July 2024\n4. Photographs of the Petitioner's demolished dwelling\n5. Photographs of current temporary shelter\n6. Medical report on the psychological impact on the Petitioner's children\n7. Affidavit of service on the Attorney General\n8. List of 200 affected households in Kibera\nSUPPORTING AFFIDAVIT\nI, MARY WANJIKU KAMAU, of P.O. Box XXXX, Nairobi in the Republic of Kenya, do\nhereby make oath and state as follows:\n1. THAT I am the Petitioner herein and am conversant with the facts of this case.\n2. THAT the facts deposed to in this Affidavit are true to the best of my knowledge,\ninformation and belief.\n3. THAT the contents of the foregoing Petition are true and accurate.\n4. THAT I have resided in Kibera for fifteen years and have made my dwelling there my\nfamily home.\n5. THAT I am a small-scale trader earning approximately KES 6,000 per month from\nselling vegetables at Toi Market.\n6. THAT I used my limited savings over many years to improve my dwelling with iron\nsheets, a proper door, and a small extension for my children.\n7. THAT on 10th July 2024, I received a demolition notice giving me 15 days to obtain a\npermit costing KES 50,000.\n8. THAT I attempted to raise the money but it was impossible as it represents more than\neight months of my income.\n9. THAT on 25th July 2024, County officers demolished my home without giving me a\nchance to remove my belongings or to be heard.\n10. THAT my children and I have suffered greatly since the demolition and are living in\ninhumane conditions.\n11. THAT I was never consulted before the Act was passed and neither were other\nresidents of Kibera.\n12. THAT I bring this Petition in good faith to protect my rights and those of my children.\nSWORN at Nairobi\nthis 15th day of August 2024\nBEFORE ME:\nCOMMISSIONER FOR OATHS\nMARY WANJIKU KAMAU\nPetitioner\nEND OF PETITION",
      "type": "application/pdf"
    },
    "summary_Summary_of_Constitutional_Petition_and_Legal_Strat_2025-12-20T11-14-52.pdf": {
      "name": "summary_Summary_of_Constitutional_Petition_and_Legal_Strat_2025-12-20T11-14-52.pdf",
      "content": "This document summarizes the Constitutional Petition filed by Mary Wanjiku Kamau against the County Government of Nairobi, the Attorney General, and the Nairobi City County Assembly.\n\n**Background:**\nThe Petitioner, Mary Wanjiku Kamau, a small-scale trader residing in Kibera, challenges The Nairobi City County Informal Settlements (Regulation and Control) Act, 2024. This Act led to the demolition of her home and approximately 200 other structures in Kibera without a court order, alternative accommodation, or compensation. The Act also imposed prohibitive permit fees (KES 50,000) that were beyond the means of residents like the Petitioner.\n\n**Constitutional and Legal Violations:**\nThe key violations alleged in the petition are:\n*   **Violation of the Right to Accessible and Adequate Housing (Article 43(1)(b) of the Constitution of Kenya):** The demolitions rendered the Petitioner and her family homeless without providing alternative accommodation, and the imposed permit fees were prohibitive.\n*   **Lack of Due Process:** The demolitions were conducted without a court order, adequate notice, or provision for compensation, directly contradicting established legal precedents.\n\n**Legal Strategy/Angle of Attack:**\nThe primary angle of attack should focus on the direct violation of Article 43(1)(b) of the Constitution of Kenya, which guarantees every person the right to accessible and adequate housing. This is strongly supported by the landmark Supreme Court decision in **Mitu-Bell Welfare Society v Kenya Airports Authority & Others (2021)**. This case established that demolitions of informal settlements without proper notice, consultation, or the provision of alternative accommodation are unconstitutional.\n\nThe argument should highlight:\n1.  The absence of a court order for demolition.\n2.  The failure to provide alternative housing or compensation.\n3.  The unreasonableness and prohibitive nature of the permit fees imposed by the Impugned Act, effectively making it impossible for residents to comply and retain their homes.\n4.  The general lack of due process in the enforcement of the Act, directly contravening constitutional safeguards and established case law.",
      "type": "generated"
    }
  },
  "da20b8b5-c154-447f-8a0e-da76e3dd8e42": {
    "f3a850e4-a972-4c46-859b-2e7dec58d527": {
      "name": "CONSTITUTIONAL PETITION.pdf",
      "content": "IN THE HIGH COURT OF KENYA AT\nNAIROBI\nCONSTITUTIONAL AND JUDICIAL REVIEW DIVISION\nPETITION NO. 347 OF 2024\nBETWEEN\nMARY WANJIKU KAMAU .................................................... PETITIONER\nAND\nTHE COUNTY GOVERNMENT OF NAIROBI ................ 1ST RESPONDENT\nTHE ATTORNEY GENERAL ................................................ 2ND RESPONDENT\nTHE NAIROBI CITY COUNTY ASSEMBLY .................. 3RD RESPONDENT\nCONSTITUTIONAL PETITION\n(Under Articles 22, 23, 43, 165(3)(d) of the Constitution of Kenya, 2010 and Section 7 of the\nEnvironment and Land Court Act, 2011)\nA. PARTIES TO THE PETITION\n1. THE PETITIONER\n1.1 The Petitioner, MARY WANJIKU KAMAU, is an adult Kenyan citizen residing in Kibera,\nNairobi County, within the Republic of Kenya. She is a small-scale trader operating a\nvegetable stall at the Toi Market and a mother of three children.\n1.2 The Petitioner brings this Petition in her own interest and in the public interest pursuant\nto Article 22(1) and (2) of the Constitution, seeking to enforce fundamental rights and\nfreedoms guaranteed under the Bill of Rights.\n2. THE RESPONDENTS\n2.1 The 1st Respondent, THE COUNTY GOVERNMENT OF NAIROBI, is a County\nGovernment established under Article 176 of the Constitution with its principal offices at City\nHall, Nairobi. The 1st Respondent has constitutional and statutory obligations to deliver\nservices and protect the rights of residents within Nairobi County.\n2.2 The 2nd Respondent, THE ATTORNEY GENERAL, is the principal legal advisor to the\nGovernment of Kenya appointed under Article 156 of the Constitution and is sued in his\ncapacity as representative of the National Government.\n2.3 The 3rd Respondent, THE NAIROBI CITY COUNTY ASSEMBLY, is the legislative arm of\nthe County Government established under Article 176(2) of the Constitution with\nresponsibility for making laws for the County.\nB. BACKGROUND AND FACTS\n3. FACTUAL MATRIX\n3.1 The Petitioner has resided in Kibera, Nairobi County, for the past fifteen (15) years\ntogether with her three children aged 8, 11, and 14 years.\n3.2 Kibera is one of the largest informal settlements in Africa, home to approximately\n250,000 residents who live in conditions of extreme poverty and deprivation.\n3.3 On or about 15th March 2024, the 3rd Respondent passed The Nairobi City County\nInformal Settlements (Regulation and Control) Act, 2024 (\"the impugned Act\"), which was\nassented to by the County Governor on 28th March 2024.\n3.4 The impugned Act purports to regulate informal settlements within Nairobi County and\ncontains the following key provisions:\na) Section 7: Prohibits the construction, modification, or occupation of any structure in\ndesignated informal settlements without a permit from the County Government.\nb) Section 12: Empowers County Enforcement Officers to demolish any structure deemed\n\"illegal\" or \"non-compliant\" without a court order.\nc) Section 15: Imposes a mandatory permit fee of KES 50,000 for existing structures and\nKES 75,000 for new structures in informal settlements.\nd) Section 18: Provides that failure to obtain a permit within 90 days of the Act's\ncommencement renders the structure illegal and subject to immediate demolition.\ne) Section 21: Excludes any right to compensation for demolished structures.\n3.5 On 10th July 2024, the Petitioner received a notice from the 1st Respondent's\nEnforcement Department stating that her dwelling structure was in violation of the impugned\nAct and would be demolished on 25th July 2024 unless she obtained the requisite permit.\n3.6 The Petitioner attempted to apply for the permit but was unable to raise the KES 50,000\nfee, which represents approximately eight months of her income from her vegetable stall.\n3.7 On 25th July 2024, at approximately 6:00 AM, County Enforcement Officers,\naccompanied by police officers, arrived at Kibera and proceeded to demolish approximately\n200 structures, including the Petitioner's home.\n3.8 The demolition was conducted without any court order and without providing alternative\naccommodation or compensation to the affected residents.\n3.9 The Petitioner and her children have since been living in a temporary shelter constructed\nfrom salvaged materials and are exposed to the elements, with no access to adequate\nsanitation or security.\n3.10 The Petitioner has suffered significant psychological trauma, and her children have\nbeen unable to attend school regularly due to lack of stable housing.\nC. CONSTITUTIONAL AND LEGAL VIOLATIONS\n4. VIOLATION OF THE RIGHT TO ACCESSIBLE AND ADEQUATE\nHOUSING (ARTICLE 43(1)(b))\n4.1 Article 43(1)(b) of the Constitution guarantees every person \"the right to accessible and\nadequate housing, and to reasonable standards of sanitation.\"\n4.2 The impugned Act and the subsequent demolitions have directly violated this\nconstitutional right by:\na) Rendering the Petitioner and her family homeless without providing alternative\naccommodation;\nb) Imposing prohibitive permit fees that are beyond the means of informal settlement\nresidents, thereby making housing inaccessible;\nc) Failing to progressively realize the right to housing as required under Article 21(2) of the\nConstitution.\n4.3 In Satrose Ayuma & 11 Others v Registered Trustees of the Kenya Railways Staff\nRetirement Benefits Scheme & 2 Others [2016] eKLR, the Court of Appeal held that:\n\"The right to accessible and adequate housing under Article 43(1)(b) is not\nmerely a right to shelter but encompasses security of tenure, availability of\nservices, affordability, habitability, accessibility, location and cultural adequacy.\"\n4.4 The 1st Respondent has failed to provide any alternative housing or resettlement plan for\nthe affected residents, thereby violating the progressive realization principle.\n5. VIOLATION OF THE RIGHT TO HUMAN DIGNITY (ARTICLE 28)\n5.1 Article 28 of the Constitution provides that \"Every person has inherent dignity and the\nright to have that dignity respected and protected.\"\n5.2 The demolition of the Petitioner's home in the manner conducted, leaving her and her\nchildren exposed to the elements without shelter, has violated her fundamental right to\ndignity.\n5.3 In Francis Karioko Muruatetu & Another v Republic [2017] eKLR, the Supreme Court\nemphasized that:\n\"Human dignity is the foundation of all human rights and must be respected and\nprotected in all circumstances.\"\n5.4 The treatment of the Petitioner and other Kibera residents as though their homes and\nlives are disposable constitutes a grave affront to human dignity.\n6. VIOLATION OF THE RIGHT TO FAIR ADMINISTRATIVE ACTION\n(ARTICLE 47)\n6.1 Article 47 of the Constitution guarantees every person the right to administrative action\nthat is expeditious, efficient, lawful, reasonable, and procedurally fair.\n6.2 Section 12 of the impugned Act authorizes demolitions without a court order, thereby\nviolating the principles of fair administrative action by:\na) Failing to provide an opportunity for affected persons to be heard before demolition;\nb) Failing to provide reasons for the administrative decision to demolish;\nc) Denying affected persons the right to seek judicial review before the administrative action\nis executed.\n6.3 In Anarita Karimi Njeru v Republic [1979] eKLR, the Court of Appeal established the\nduty to afford a hearing before adverse administrative action, stating:\n\"The rules of natural justice require that a person be given notice and an\nopportunity to be heard before a decision affecting their rights is made.\"\n6.4 The 1st Respondent proceeded with demolitions without providing individual hearings or\nany meaningful opportunity for affected residents to present their cases.\n7. VIOLATION OF CHILDREN'S RIGHTS (ARTICLE 53)\n7.1 Article 53(1) of the Constitution provides that every child has the right to basic nutrition,\nshelter, basic health care, and education.\n7.2 The Petitioner's three children have been deprived of adequate shelter, their education\nhas been disrupted, and they have been exposed to health hazards as a result of the\ndemolition.\n7.3 In CMS & 12 Others v Attorney General & 2 Others [2020] eKLR, the High Court held\nthat:\n\"The State has an obligation to take positive measures to protect children's\nrights, and any action that exposes children to harm or deprivation violates\nArticle 53.\"\n7.4 The 1st Respondent failed to conduct any child impact assessment before undertaking\nthe demolitions, contrary to the principles in the Children Act, 2022.\n8. VIOLATION OF THE RIGHT TO PROPERTY (ARTICLE 40)\n8.1 Article 40(1) of the Constitution protects every person's right to own property either\nindividually or in association with others.\n8.2 Article 40(3) provides that the State shall not deprive a person of property without\ncompensation.\n8.3 The Petitioner had possessory rights over her dwelling and the improvements she made\nto it over fifteen years, which constitute property within the meaning of Article 40.\n8.4 In Mitubell Welfare Society v Kenya Airports Authority & 2 Others [2013] eKLR, the\nSupreme Court recognized that:\n\"Property rights extend beyond formal title to include possessory rights and\nlegitimate expectations of continued occupation.\"\n8.5 Section 21 of the impugned Act, which excludes compensation for demolished\nstructures, is unconstitutional and void as it violates Article 40(3).\n9. VIOLATION OF EQUALITY AND FREEDOM FROM DISCRIMINATION\n(ARTICLE 27)\n9.1 Article 27(1) provides that every person is equal before the law and has the right to equal\nprotection and equal benefit of the law.\n9.2 The impugned Act disproportionately affects poor and marginalized communities in\ninformal settlements while residents of formal housing areas are not subject to similar\narbitrary regulations or demolitions.\n9.3 The permit fees of KES 50,000-75,000 are discriminatory as they are unaffordable to\ninformal settlement residents whose average monthly income is approximately KES 6,000.\n9.4 In Federation of Women Lawyers (FIDA-K) & 5 Others v Attorney General &\nAnother [2019] eKLR, the Constitutional Court stated:\n\"Discrimination can occur through laws that are facially neutral but have a\ndisproportionate impact on marginalized groups.\"\n9.5 The impugned Act constitutes indirect discrimination against the poor and violates Article\n27.\n10. VIOLATION OF THE PRINCIPLE OF PUBLIC PARTICIPATION\n(ARTICLE 10 AND 196)\n10.1 Article 10(2)(a) of the Constitution establishes public participation as a national value\nand principle of governance.\n10.2 Article 196(1) specifically requires County Governments to conduct public participation\nin the exercise of their powers and performance of functions.\n10.3 The 3rd Respondent enacted the impugned Act without meaningful public participation,\nparticularly without consulting the residents of informal settlements who would be directly\naffected.\n10.4 In Doctors for Life International v Speaker of the National Assembly & Others\n(CCT 12/05) [2006] ZACC 11 (a persuasive South African authority frequently cited in\nKenya), the Constitutional Court held that:\n\"Public participation must be meaningful, and those most affected by legislation\nmust be given a reasonable opportunity to know about the issues and to have\nan adequate say.\"\n10.5 The 1st and 3rd Respondents failed to conduct any consultative forums in Kibera or\nother informal settlements before enacting the law.\nD. APPLICABLE LAW\n11. CONSTITUTIONAL PROVISIONS\n11.1 The following provisions of the Constitution of Kenya, 2010 are directly applicable:\nArticle 10 – National values and principles of governance, including human dignity, equity,\nsocial justice, and public participation.\nArticle 19(2) – The purpose of recognizing and protecting human rights and fundamental\nfreedoms is to preserve the dignity of individuals and communities.\nArticle 20 – Application of the Bill of Rights, particularly:\n● Article 20(2): The State and every State organ must respect, protect, promote and\nfulfill the rights in the Bill of Rights.\n● Article 20(4): The State must take legislative, policy and other measures, including\nsetting standards, to achieve the progressive realization of economic and social\nrights.\nArticle 21 – Implementation of rights and fundamental freedoms, which places an obligation\non the State to observe, respect, protect, promote and fulfill the rights in the Bill of Rights.\nArticle 22 – Enforcement of the Bill of Rights, which empowers any person to approach the\nHigh Court alleging that a right has been denied, violated or infringed.\nArticle 23 – Authority of courts to uphold and enforce the Bill of Rights, including granting\nappropriate relief and awarding compensation.\nArticle 27 – Equality and freedom from discrimination.\nArticle 28 – Right to human dignity.\nArticle 40 – Right to property, including protection against deprivation without compensation.\nArticle 43 – Economic and social rights, specifically:\n● Article 43(1)(b): The right to accessible and adequate housing and reasonable\nstandards of sanitation.\nArticle 47 – Right to fair administrative action.\nArticle 53 – Children's rights, including the right to shelter, education, and protection from\nharm.\nArticle 165(3)(d) – Jurisdiction of the High Court to hear constitutional matters.\nArticle 176 – Establishment and powers of County Governments.\nArticle 196 – Public participation in County Government functions.\n12. STATUTORY LAW\n12.1 The Fair Administrative Action Act, No. 4 of 2015\nSection 4 provides that administrative action must be:\n● Procedurally fair\n● Expeditious, efficient, lawful, reasonable and proportionate\nSection 6 requires that before making a decision affecting a person's rights, the administrator\nmust give notice and opportunity to make representations.\n12.2 The Children Act, 2022\nSection 9 places a duty on the State to progressively implement children's rights, including\nthe right to shelter.\n12.3 The Environment and Land Court Act, 2011\nSection 13 grants the Court jurisdiction over matters relating to environmental and land use\nplanning.\n13. INTERNATIONAL LAW\n13.1 Pursuant to Article 2(5) and (6) of the Constitution, general rules of international law\nand treaties ratified by Kenya form part of Kenyan law.\n13.2 International Covenant on Economic, Social and Cultural Rights (ICESCR)\nKenya ratified the ICESCR in 1972. Article 11(1) recognizes \"the right of everyone to an\nadequate standard of living for himself and his family, including adequate food, clothing and\nhousing.\"\nGeneral Comment No. 4 on the right to adequate housing emphasizes security of tenure,\nprotection against forced evictions, and the requirement of alternative accommodation.\n13.3 The African Charter on Human and Peoples' Rights\nKenya ratified the Charter in 1992. Article 14 protects the right to property, and Article 18\nrequires the State to ensure the protection of the family.\n13.4 Convention on the Rights of the Child (CRC)\nKenya ratified the CRC in 1990. Article 27 recognizes the right of every child to a standard of\nliving adequate for the child's physical, mental, spiritual, moral and social development.\nE. GROUNDS OF THE PETITION\n14. ILLEGALITY AND UNCONSTITUTIONALITY OF THE IMPUGNED ACT\n14.1 The impugned Act is unconstitutional, illegal, null and void ab initio for the following\nreasons:\na) It violates Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) It was enacted without public participation in violation of Articles 10 and 196 of the\nConstitution;\nc) It imposes disproportionate and discriminatory financial burdens on the poor;\nd) It authorizes arbitrary administrative action without judicial oversight;\ne) It excludes compensation in violation of Article 40(3);\nf) It fails to provide for alternative accommodation or progressive realization of housing\nrights.\n15. ILLEGALITY OF THE DEMOLITIONS\n15.1 The demolitions conducted on 25th July 2024 were illegal, unconstitutional and violated\nthe Petitioner's fundamental rights because:\na) They were conducted without court orders;\nb) No individual notice or hearing was provided to affected residents;\nc) No alternative accommodation was provided;\nd) No compensation was offered;\ne) The actions violated the principles of fair administrative action under Article 47;\nf) The demolitions exposed children to harm in violation of Article 53;\ng) The actions violated international law standards on forced evictions.\n16. FAILURE OF CONSTITUTIONAL OBLIGATIONS\n16.1 The Respondents have failed in their constitutional obligations under Article 21 to\nrespect, protect, promote and fulfill the rights in the Bill of Rights.\n16.2 The Respondents have failed to progressively realize the right to housing under Article\n43 and have instead taken retrogressive measures.\nF. RELIEFS SOUGHT\n17. WHEREFORE, the Petitioner humbly prays that this Honourable\nCourt be pleased to:\nDECLARATIONS\na) DECLARE that Sections 7, 12, 15, 18, and 21 of The Nairobi City County Informal\nSettlements (Regulation and Control) Act, 2024 are unconstitutional, null and void for\nviolating Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) DECLARE that the demolition of the Petitioner's dwelling on 25th July 2024 was illegal,\nunconstitutional and violated the Petitioner's rights under Articles 28, 40, 43, 47, and 53 of\nthe Constitution;\nc) DECLARE that the 1st and 3rd Respondents violated the Petitioner's right to public\nparticipation under Articles 10 and 196 of the Constitution by enacting the impugned Act\nwithout meaningful consultation with informal settlement residents;\nd) DECLARE that the Respondents have a constitutional obligation to progressively realize\nthe right to adequate housing under Article 43(1)(b) and must take positive measures to\nprovide housing for informal settlement residents;\nORDERS\ne) ORDER that the 1st Respondent immediately provide the Petitioner with alternative\nadequate temporary housing pending permanent resettlement;\nf) ORDER the 1st Respondent to compensate the Petitioner for the demolition of her\ndwelling and for the violation of her constitutional rights;\ng) ORDER the 1st and 3rd Respondents to develop, within six (6) months, a comprehensive\ninformal settlements upgrading policy that complies with constitutional requirements,\nincludes public participation, provides for security of tenure, and progressively realizes\nhousing rights;\nh) ORDER the 1st Respondent to immediately cease all further demolitions in informal\nsettlements until a constitutional policy framework is established;\ni) ISSUE a permanent injunction restraining the Respondents from implementing Sections 7,\n12, 15, 18, and 21 of the impugned Act;\nGENERAL RELIEF\nj) AWARD general and aggravated damages to the Petitioner for violation of her\nconstitutional rights;\nk) AWARD the costs of this Petition;\nl) GRANT any other relief that this Honourable Court may deem just and appropriate.\nG. CERTIFICATION OF URGENCY\n18. This Petition is urgent and requires immediate hearing because:\na) The Petitioner and her children are currently homeless and living in dehumanizing\nconditions;\nb) The children's health, safety, and education are at immediate risk;\nc) The 1st Respondent continues to conduct demolitions in informal settlements, affecting\nthousands of residents;\nd) The rainy season is approaching, which will further expose homeless residents to\nlife-threatening conditions;\ne) Irreparable harm is being suffered daily by the Petitioner and other affected persons.\nH. NOTICE TO THE ATTORNEY GENERAL\n19. Notice of this Constitutional Petition has been duly served upon the Attorney General\npursuant to Article 165(4) of the Constitution and Order 34 Rule 5 of the Constitution\nof Kenya (Protection of Rights and Fundamental Freedoms) Practice and Procedure\nRules, 2013.\nDATED at Nairobi this 15th day of August, 2024\nFILED by:\nKAMAU & ASSOCIATES ADVOCATES\nAdvocates for the Petitioner\nP.O. Box 12345-00100\nNairobi, Kenya\nTel: +254 712 345 678\nEmail: info@kamauadvocates.co.ke\nSIGNED:\nJAMES KAMAU MWANGI\nAdvocate for the Petitioner\nSCHEDULE OF DOCUMENTS\n1. Copy of the Petitioner's National Identity Card\n2. Copy of The Nairobi City County Informal Settlements (Regulation and Control) Act,\n2024\n3. Demolition Notice dated 10th July 2024\n4. Photographs of the Petitioner's demolished dwelling\n5. Photographs of current temporary shelter\n6. Medical report on the psychological impact on the Petitioner's children\n7. Affidavit of service on the Attorney General\n8. List of 200 affected households in Kibera\nSUPPORTING AFFIDAVIT\nI, MARY WANJIKU KAMAU, of P.O. Box XXXX, Nairobi in the Republic of Kenya, do\nhereby make oath and state as follows:\n1. THAT I am the Petitioner herein and am conversant with the facts of this case.\n2. THAT the facts deposed to in this Affidavit are true to the best of my knowledge,\ninformation and belief.\n3. THAT the contents of the foregoing Petition are true and accurate.\n4. THAT I have resided in Kibera for fifteen years and have made my dwelling there my\nfamily home.\n5. THAT I am a small-scale trader earning approximately KES 6,000 per month from\nselling vegetables at Toi Market.\n6. THAT I used my limited savings over many years to improve my dwelling with iron\nsheets, a proper door, and a small extension for my children.\n7. THAT on 10th July 2024, I received a demolition notice giving me 15 days to obtain a\npermit costing KES 50,000.\n8. THAT I attempted to raise the money but it was impossible as it represents more than\neight months of my income.\n9. THAT on 25th July 2024, County officers demolished my home without giving me a\nchance to remove my belongings or to be heard.\n10. THAT my children and I have suffered greatly since the demolition and are living in\ninhumane conditions.\n11. THAT I was never consulted before the Act was passed and neither were other\nresidents of Kibera.\n12. THAT I bring this Petition in good faith to protect my rights and those of my children.\nSWORN at Nairobi\nthis 15th day of August 2024\nBEFORE ME:\nCOMMISSIONER FOR OATHS\nMARY WANJIKU KAMAU\nPetitioner\nEND OF PETITION",
      "type": "application/pdf"
    },
    "brief_Counter-Brief_to_Mary_Wanjiku_v_County_Government__2025-12-20T12-16-44.pdf": {
      "name": "brief_Counter-Brief_to_Mary_Wanjiku_v_County_Government__2025-12-20T12-16-44.pdf",
      "content": "Your Honor, the County Government extends its sympathies to Ms. Wanjiku. However, the assertions made by opposing counsel require scrutiny in light of established legal principles and the county's mandate to uphold law and order.\n\nFirst, regarding the alleged lack of a court order: While courts emphasize due process, including statutory notice and fair hearings, the requirement for a specific court order for every demolition of an illegal structure, particularly on public land or for non-compliance with planning laws, is not absolute. The crucial element is *fair administrative action*, which primarily entails adequate notice and an opportunity to be heard, not necessarily a pre-demolition court order in all instances. As seen in *Farid Faraj v County Government of Kilifi* [1], the focus is on preventing rushed demolitions without hearing the owner and adhering to statutory notice timelines, not an outright prohibition of demolition without a prior court order.\n\nSecond, on the matter of compensation: Kenyan courts indeed recognize the right to compensation, particularly where demolitions are unlawful or procedurally flawed, as illustrated by *In re Compensation for Illegal Demolition of Kibuye Jua Kali Association Properties* [2, 4]. However, the nature and extent of compensation depend heavily on whether the structure itself was legal and whether due process was observed. If a structure is deemed illegal and the owner has failed to comply with lawful demands, such as obtaining a permit, the claim for compensation for the structure itself may be significantly diminished, though compensation for procedural breaches remains a consideration. The County must also be afforded the opportunity to demonstrate that its actions were lawful and procedurally sound, thus potentially mitigating claims for compensation for the structure.\n\nThird, the claim for alternative shelter: Our research reveals no uniform national law that universally mandates the provision of alternative housing in all demolition scenarios, particularly for illegal structures. While proposed legislation, such as the Nairobi City County Evictions, Resettlement and Demolitions Bill 2023 [5], suggests providing relocation or resettlement *where feasible*, this is not an absolute, legally enshrined right in every case. The obligation for alternative housing often depends on specific facts, including the legality of the structure and the land ownership.\n\nFinally, concerning the alleged violations of constitutional rights:\n*   **Article 43 (Right to Housing):** This right is not absolute and must be balanced against the county government's legitimate interest in urban planning, public safety, and the enforcement of land use regulations. Occupying land or constructing structures without the requisite permits or in violation of planning laws undermines this balance. The demand for a permit fee is a legitimate regulatory requirement, and non-compliance does not automatically trigger a violation of the right to housing when lawful enforcement actions are taken.\n*   **Article 47 (Right to Fair Administrative Action):** This right focuses on due process, which includes timely notice and an opportunity to be heard. The claimant's failure to pay a legitimate permit fee, and the potential issuance of notices, would be critical in determining whether fair administrative action was indeed afforded.\n*   **Article 28 (Right to Dignity) and Article 53 (Children's Rights):** While the circumstances are regrettable, the county's actions, if legally justified and procedurally correct in enforcing bylaws, do not inherently constitute an attack on dignity. The responsibility to ensure a safe and legal living environment for children ultimately rests with the parents, who must comply with the law. The County’s actions are aimed at enforcing the law, not at violating individual dignity or children’s rights.\n\nIn conclusion, Your Honor, the County Government maintains that its actions were taken within the legal framework to enforce compliance with urban planning and land use regulations. We contend that the claimant's arguments overlook the conditional nature of these rights and the legitimate regulatory powers of the County Government. We urge the court to consider the full context of the county's actions and the claimant's non-compliance with established procedures.\n",
      "type": "generated"
    }
  },
  "d7de31e8-2df8-4a27-8a73-554c02cc0edb": {
    "6aacda4d-a2dd-41c3-8591-f2f22248b89f": {
      "name": "CONSTITUTIONAL PETITION.pdf",
      "content": "IN THE HIGH COURT OF KENYA AT\nNAIROBI\nCONSTITUTIONAL AND JUDICIAL REVIEW DIVISION\nPETITION NO. 347 OF 2024\nBETWEEN\nMARY WANJIKU KAMAU .................................................... PETITIONER\nAND\nTHE COUNTY GOVERNMENT OF NAIROBI ................ 1ST RESPONDENT\nTHE ATTORNEY GENERAL ................................................ 2ND RESPONDENT\nTHE NAIROBI CITY COUNTY ASSEMBLY .................. 3RD RESPONDENT\nCONSTITUTIONAL PETITION\n(Under Articles 22, 23, 43, 165(3)(d) of the Constitution of Kenya, 2010 and Section 7 of the\nEnvironment and Land Court Act, 2011)\nA. PARTIES TO THE PETITION\n1. THE PETITIONER\n1.1 The Petitioner, MARY WANJIKU KAMAU, is an adult Kenyan citizen residing in Kibera,\nNairobi County, within the Republic of Kenya. She is a small-scale trader operating a\nvegetable stall at the Toi Market and a mother of three children.\n1.2 The Petitioner brings this Petition in her own interest and in the public interest pursuant\nto Article 22(1) and (2) of the Constitution, seeking to enforce fundamental rights and\nfreedoms guaranteed under the Bill of Rights.\n2. THE RESPONDENTS\n2.1 The 1st Respondent, THE COUNTY GOVERNMENT OF NAIROBI, is a County\nGovernment established under Article 176 of the Constitution with its principal offices at City\nHall, Nairobi. The 1st Respondent has constitutional and statutory obligations to deliver\nservices and protect the rights of residents within Nairobi County.\n2.2 The 2nd Respondent, THE ATTORNEY GENERAL, is the principal legal advisor to the\nGovernment of Kenya appointed under Article 156 of the Constitution and is sued in his\ncapacity as representative of the National Government.\n2.3 The 3rd Respondent, THE NAIROBI CITY COUNTY ASSEMBLY, is the legislative arm of\nthe County Government established under Article 176(2) of the Constitution with\nresponsibility for making laws for the County.\nB. BACKGROUND AND FACTS\n3. FACTUAL MATRIX\n3.1 The Petitioner has resided in Kibera, Nairobi County, for the past fifteen (15) years\ntogether with her three children aged 8, 11, and 14 years.\n3.2 Kibera is one of the largest informal settlements in Africa, home to approximately\n250,000 residents who live in conditions of extreme poverty and deprivation.\n3.3 On or about 15th March 2024, the 3rd Respondent passed The Nairobi City County\nInformal Settlements (Regulation and Control) Act, 2024 (\"the impugned Act\"), which was\nassented to by the County Governor on 28th March 2024.\n3.4 The impugned Act purports to regulate informal settlements within Nairobi County and\ncontains the following key provisions:\na) Section 7: Prohibits the construction, modification, or occupation of any structure in\ndesignated informal settlements without a permit from the County Government.\nb) Section 12: Empowers County Enforcement Officers to demolish any structure deemed\n\"illegal\" or \"non-compliant\" without a court order.\nc) Section 15: Imposes a mandatory permit fee of KES 50,000 for existing structures and\nKES 75,000 for new structures in informal settlements.\nd) Section 18: Provides that failure to obtain a permit within 90 days of the Act's\ncommencement renders the structure illegal and subject to immediate demolition.\ne) Section 21: Excludes any right to compensation for demolished structures.\n3.5 On 10th July 2024, the Petitioner received a notice from the 1st Respondent's\nEnforcement Department stating that her dwelling structure was in violation of the impugned\nAct and would be demolished on 25th July 2024 unless she obtained the requisite permit.\n3.6 The Petitioner attempted to apply for the permit but was unable to raise the KES 50,000\nfee, which represents approximately eight months of her income from her vegetable stall.\n3.7 On 25th July 2024, at approximately 6:00 AM, County Enforcement Officers,\naccompanied by police officers, arrived at Kibera and proceeded to demolish approximately\n200 structures, including the Petitioner's home.\n3.8 The demolition was conducted without any court order and without providing alternative\naccommodation or compensation to the affected residents.\n3.9 The Petitioner and her children have since been living in a temporary shelter constructed\nfrom salvaged materials and are exposed to the elements, with no access to adequate\nsanitation or security.\n3.10 The Petitioner has suffered significant psychological trauma, and her children have\nbeen unable to attend school regularly due to lack of stable housing.\nC. CONSTITUTIONAL AND LEGAL VIOLATIONS\n4. VIOLATION OF THE RIGHT TO ACCESSIBLE AND ADEQUATE\nHOUSING (ARTICLE 43(1)(b))\n4.1 Article 43(1)(b) of the Constitution guarantees every person \"the right to accessible and\nadequate housing, and to reasonable standards of sanitation.\"\n4.2 The impugned Act and the subsequent demolitions have directly violated this\nconstitutional right by:\na) Rendering the Petitioner and her family homeless without providing alternative\naccommodation;\nb) Imposing prohibitive permit fees that are beyond the means of informal settlement\nresidents, thereby making housing inaccessible;\nc) Failing to progressively realize the right to housing as required under Article 21(2) of the\nConstitution.\n4.3 In Satrose Ayuma & 11 Others v Registered Trustees of the Kenya Railways Staff\nRetirement Benefits Scheme & 2 Others [2016] eKLR, the Court of Appeal held that:\n\"The right to accessible and adequate housing under Article 43(1)(b) is not\nmerely a right to shelter but encompasses security of tenure, availability of\nservices, affordability, habitability, accessibility, location and cultural adequacy.\"\n4.4 The 1st Respondent has failed to provide any alternative housing or resettlement plan for\nthe affected residents, thereby violating the progressive realization principle.\n5. VIOLATION OF THE RIGHT TO HUMAN DIGNITY (ARTICLE 28)\n5.1 Article 28 of the Constitution provides that \"Every person has inherent dignity and the\nright to have that dignity respected and protected.\"\n5.2 The demolition of the Petitioner's home in the manner conducted, leaving her and her\nchildren exposed to the elements without shelter, has violated her fundamental right to\ndignity.\n5.3 In Francis Karioko Muruatetu & Another v Republic [2017] eKLR, the Supreme Court\nemphasized that:\n\"Human dignity is the foundation of all human rights and must be respected and\nprotected in all circumstances.\"\n5.4 The treatment of the Petitioner and other Kibera residents as though their homes and\nlives are disposable constitutes a grave affront to human dignity.\n6. VIOLATION OF THE RIGHT TO FAIR ADMINISTRATIVE ACTION\n(ARTICLE 47)\n6.1 Article 47 of the Constitution guarantees every person the right to administrative action\nthat is expeditious, efficient, lawful, reasonable, and procedurally fair.\n6.2 Section 12 of the impugned Act authorizes demolitions without a court order, thereby\nviolating the principles of fair administrative action by:\na) Failing to provide an opportunity for affected persons to be heard before demolition;\nb) Failing to provide reasons for the administrative decision to demolish;\nc) Denying affected persons the right to seek judicial review before the administrative action\nis executed.\n6.3 In Anarita Karimi Njeru v Republic [1979] eKLR, the Court of Appeal established the\nduty to afford a hearing before adverse administrative action, stating:\n\"The rules of natural justice require that a person be given notice and an\nopportunity to be heard before a decision affecting their rights is made.\"\n6.4 The 1st Respondent proceeded with demolitions without providing individual hearings or\nany meaningful opportunity for affected residents to present their cases.\n7. VIOLATION OF CHILDREN'S RIGHTS (ARTICLE 53)\n7.1 Article 53(1) of the Constitution provides that every child has the right to basic nutrition,\nshelter, basic health care, and education.\n7.2 The Petitioner's three children have been deprived of adequate shelter, their education\nhas been disrupted, and they have been exposed to health hazards as a result of the\ndemolition.\n7.3 In CMS & 12 Others v Attorney General & 2 Others [2020] eKLR, the High Court held\nthat:\n\"The State has an obligation to take positive measures to protect children's\nrights, and any action that exposes children to harm or deprivation violates\nArticle 53.\"\n7.4 The 1st Respondent failed to conduct any child impact assessment before undertaking\nthe demolitions, contrary to the principles in the Children Act, 2022.\n8. VIOLATION OF THE RIGHT TO PROPERTY (ARTICLE 40)\n8.1 Article 40(1) of the Constitution protects every person's right to own property either\nindividually or in association with others.\n8.2 Article 40(3) provides that the State shall not deprive a person of property without\ncompensation.\n8.3 The Petitioner had possessory rights over her dwelling and the improvements she made\nto it over fifteen years, which constitute property within the meaning of Article 40.\n8.4 In Mitubell Welfare Society v Kenya Airports Authority & 2 Others [2013] eKLR, the\nSupreme Court recognized that:\n\"Property rights extend beyond formal title to include possessory rights and\nlegitimate expectations of continued occupation.\"\n8.5 Section 21 of the impugned Act, which excludes compensation for demolished\nstructures, is unconstitutional and void as it violates Article 40(3).\n9. VIOLATION OF EQUALITY AND FREEDOM FROM DISCRIMINATION\n(ARTICLE 27)\n9.1 Article 27(1) provides that every person is equal before the law and has the right to equal\nprotection and equal benefit of the law.\n9.2 The impugned Act disproportionately affects poor and marginalized communities in\ninformal settlements while residents of formal housing areas are not subject to similar\narbitrary regulations or demolitions.\n9.3 The permit fees of KES 50,000-75,000 are discriminatory as they are unaffordable to\ninformal settlement residents whose average monthly income is approximately KES 6,000.\n9.4 In Federation of Women Lawyers (FIDA-K) & 5 Others v Attorney General &\nAnother [2019] eKLR, the Constitutional Court stated:\n\"Discrimination can occur through laws that are facially neutral but have a\ndisproportionate impact on marginalized groups.\"\n9.5 The impugned Act constitutes indirect discrimination against the poor and violates Article\n27.\n10. VIOLATION OF THE PRINCIPLE OF PUBLIC PARTICIPATION\n(ARTICLE 10 AND 196)\n10.1 Article 10(2)(a) of the Constitution establishes public participation as a national value\nand principle of governance.\n10.2 Article 196(1) specifically requires County Governments to conduct public participation\nin the exercise of their powers and performance of functions.\n10.3 The 3rd Respondent enacted the impugned Act without meaningful public participation,\nparticularly without consulting the residents of informal settlements who would be directly\naffected.\n10.4 In Doctors for Life International v Speaker of the National Assembly & Others\n(CCT 12/05) [2006] ZACC 11 (a persuasive South African authority frequently cited in\nKenya), the Constitutional Court held that:\n\"Public participation must be meaningful, and those most affected by legislation\nmust be given a reasonable opportunity to know about the issues and to have\nan adequate say.\"\n10.5 The 1st and 3rd Respondents failed to conduct any consultative forums in Kibera or\nother informal settlements before enacting the law.\nD. APPLICABLE LAW\n11. CONSTITUTIONAL PROVISIONS\n11.1 The following provisions of the Constitution of Kenya, 2010 are directly applicable:\nArticle 10 – National values and principles of governance, including human dignity, equity,\nsocial justice, and public participation.\nArticle 19(2) – The purpose of recognizing and protecting human rights and fundamental\nfreedoms is to preserve the dignity of individuals and communities.\nArticle 20 – Application of the Bill of Rights, particularly:\n● Article 20(2): The State and every State organ must respect, protect, promote and\nfulfill the rights in the Bill of Rights.\n● Article 20(4): The State must take legislative, policy and other measures, including\nsetting standards, to achieve the progressive realization of economic and social\nrights.\nArticle 21 – Implementation of rights and fundamental freedoms, which places an obligation\non the State to observe, respect, protect, promote and fulfill the rights in the Bill of Rights.\nArticle 22 – Enforcement of the Bill of Rights, which empowers any person to approach the\nHigh Court alleging that a right has been denied, violated or infringed.\nArticle 23 – Authority of courts to uphold and enforce the Bill of Rights, including granting\nappropriate relief and awarding compensation.\nArticle 27 – Equality and freedom from discrimination.\nArticle 28 – Right to human dignity.\nArticle 40 – Right to property, including protection against deprivation without compensation.\nArticle 43 – Economic and social rights, specifically:\n● Article 43(1)(b): The right to accessible and adequate housing and reasonable\nstandards of sanitation.\nArticle 47 – Right to fair administrative action.\nArticle 53 – Children's rights, including the right to shelter, education, and protection from\nharm.\nArticle 165(3)(d) – Jurisdiction of the High Court to hear constitutional matters.\nArticle 176 – Establishment and powers of County Governments.\nArticle 196 – Public participation in County Government functions.\n12. STATUTORY LAW\n12.1 The Fair Administrative Action Act, No. 4 of 2015\nSection 4 provides that administrative action must be:\n● Procedurally fair\n● Expeditious, efficient, lawful, reasonable and proportionate\nSection 6 requires that before making a decision affecting a person's rights, the administrator\nmust give notice and opportunity to make representations.\n12.2 The Children Act, 2022\nSection 9 places a duty on the State to progressively implement children's rights, including\nthe right to shelter.\n12.3 The Environment and Land Court Act, 2011\nSection 13 grants the Court jurisdiction over matters relating to environmental and land use\nplanning.\n13. INTERNATIONAL LAW\n13.1 Pursuant to Article 2(5) and (6) of the Constitution, general rules of international law\nand treaties ratified by Kenya form part of Kenyan law.\n13.2 International Covenant on Economic, Social and Cultural Rights (ICESCR)\nKenya ratified the ICESCR in 1972. Article 11(1) recognizes \"the right of everyone to an\nadequate standard of living for himself and his family, including adequate food, clothing and\nhousing.\"\nGeneral Comment No. 4 on the right to adequate housing emphasizes security of tenure,\nprotection against forced evictions, and the requirement of alternative accommodation.\n13.3 The African Charter on Human and Peoples' Rights\nKenya ratified the Charter in 1992. Article 14 protects the right to property, and Article 18\nrequires the State to ensure the protection of the family.\n13.4 Convention on the Rights of the Child (CRC)\nKenya ratified the CRC in 1990. Article 27 recognizes the right of every child to a standard of\nliving adequate for the child's physical, mental, spiritual, moral and social development.\nE. GROUNDS OF THE PETITION\n14. ILLEGALITY AND UNCONSTITUTIONALITY OF THE IMPUGNED ACT\n14.1 The impugned Act is unconstitutional, illegal, null and void ab initio for the following\nreasons:\na) It violates Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) It was enacted without public participation in violation of Articles 10 and 196 of the\nConstitution;\nc) It imposes disproportionate and discriminatory financial burdens on the poor;\nd) It authorizes arbitrary administrative action without judicial oversight;\ne) It excludes compensation in violation of Article 40(3);\nf) It fails to provide for alternative accommodation or progressive realization of housing\nrights.\n15. ILLEGALITY OF THE DEMOLITIONS\n15.1 The demolitions conducted on 25th July 2024 were illegal, unconstitutional and violated\nthe Petitioner's fundamental rights because:\na) They were conducted without court orders;\nb) No individual notice or hearing was provided to affected residents;\nc) No alternative accommodation was provided;\nd) No compensation was offered;\ne) The actions violated the principles of fair administrative action under Article 47;\nf) The demolitions exposed children to harm in violation of Article 53;\ng) The actions violated international law standards on forced evictions.\n16. FAILURE OF CONSTITUTIONAL OBLIGATIONS\n16.1 The Respondents have failed in their constitutional obligations under Article 21 to\nrespect, protect, promote and fulfill the rights in the Bill of Rights.\n16.2 The Respondents have failed to progressively realize the right to housing under Article\n43 and have instead taken retrogressive measures.\nF. RELIEFS SOUGHT\n17. WHEREFORE, the Petitioner humbly prays that this Honourable\nCourt be pleased to:\nDECLARATIONS\na) DECLARE that Sections 7, 12, 15, 18, and 21 of The Nairobi City County Informal\nSettlements (Regulation and Control) Act, 2024 are unconstitutional, null and void for\nviolating Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) DECLARE that the demolition of the Petitioner's dwelling on 25th July 2024 was illegal,\nunconstitutional and violated the Petitioner's rights under Articles 28, 40, 43, 47, and 53 of\nthe Constitution;\nc) DECLARE that the 1st and 3rd Respondents violated the Petitioner's right to public\nparticipation under Articles 10 and 196 of the Constitution by enacting the impugned Act\nwithout meaningful consultation with informal settlement residents;\nd) DECLARE that the Respondents have a constitutional obligation to progressively realize\nthe right to adequate housing under Article 43(1)(b) and must take positive measures to\nprovide housing for informal settlement residents;\nORDERS\ne) ORDER that the 1st Respondent immediately provide the Petitioner with alternative\nadequate temporary housing pending permanent resettlement;\nf) ORDER the 1st Respondent to compensate the Petitioner for the demolition of her\ndwelling and for the violation of her constitutional rights;\ng) ORDER the 1st and 3rd Respondents to develop, within six (6) months, a comprehensive\ninformal settlements upgrading policy that complies with constitutional requirements,\nincludes public participation, provides for security of tenure, and progressively realizes\nhousing rights;\nh) ORDER the 1st Respondent to immediately cease all further demolitions in informal\nsettlements until a constitutional policy framework is established;\ni) ISSUE a permanent injunction restraining the Respondents from implementing Sections 7,\n12, 15, 18, and 21 of the impugned Act;\nGENERAL RELIEF\nj) AWARD general and aggravated damages to the Petitioner for violation of her\nconstitutional rights;\nk) AWARD the costs of this Petition;\nl) GRANT any other relief that this Honourable Court may deem just and appropriate.\nG. CERTIFICATION OF URGENCY\n18. This Petition is urgent and requires immediate hearing because:\na) The Petitioner and her children are currently homeless and living in dehumanizing\nconditions;\nb) The children's health, safety, and education are at immediate risk;\nc) The 1st Respondent continues to conduct demolitions in informal settlements, affecting\nthousands of residents;\nd) The rainy season is approaching, which will further expose homeless residents to\nlife-threatening conditions;\ne) Irreparable harm is being suffered daily by the Petitioner and other affected persons.\nH. NOTICE TO THE ATTORNEY GENERAL\n19. Notice of this Constitutional Petition has been duly served upon the Attorney General\npursuant to Article 165(4) of the Constitution and Order 34 Rule 5 of the Constitution\nof Kenya (Protection of Rights and Fundamental Freedoms) Practice and Procedure\nRules, 2013.\nDATED at Nairobi this 15th day of August, 2024\nFILED by:\nKAMAU & ASSOCIATES ADVOCATES\nAdvocates for the Petitioner\nP.O. Box 12345-00100\nNairobi, Kenya\nTel: +254 712 345 678\nEmail: info@kamauadvocates.co.ke\nSIGNED:\nJAMES KAMAU MWANGI\nAdvocate for the Petitioner\nSCHEDULE OF DOCUMENTS\n1. Copy of the Petitioner's National Identity Card\n2. Copy of The Nairobi City County Informal Settlements (Regulation and Control) Act,\n2024\n3. Demolition Notice dated 10th July 2024\n4. Photographs of the Petitioner's demolished dwelling\n5. Photographs of current temporary shelter\n6. Medical report on the psychological impact on the Petitioner's children\n7. Affidavit of service on the Attorney General\n8. List of 200 affected households in Kibera\nSUPPORTING AFFIDAVIT\nI, MARY WANJIKU KAMAU, of P.O. Box XXXX, Nairobi in the Republic of Kenya, do\nhereby make oath and state as follows:\n1. THAT I am the Petitioner herein and am conversant with the facts of this case.\n2. THAT the facts deposed to in this Affidavit are true to the best of my knowledge,\ninformation and belief.\n3. THAT the contents of the foregoing Petition are true and accurate.\n4. THAT I have resided in Kibera for fifteen years and have made my dwelling there my\nfamily home.\n5. THAT I am a small-scale trader earning approximately KES 6,000 per month from\nselling vegetables at Toi Market.\n6. THAT I used my limited savings over many years to improve my dwelling with iron\nsheets, a proper door, and a small extension for my children.\n7. THAT on 10th July 2024, I received a demolition notice giving me 15 days to obtain a\npermit costing KES 50,000.\n8. THAT I attempted to raise the money but it was impossible as it represents more than\neight months of my income.\n9. THAT on 25th July 2024, County officers demolished my home without giving me a\nchance to remove my belongings or to be heard.\n10. THAT my children and I have suffered greatly since the demolition and are living in\ninhumane conditions.\n11. THAT I was never consulted before the Act was passed and neither were other\nresidents of Kibera.\n12. THAT I bring this Petition in good faith to protect my rights and those of my children.\nSWORN at Nairobi\nthis 15th day of August 2024\nBEFORE ME:\nCOMMISSIONER FOR OATHS\nMARY WANJIKU KAMAU\nPetitioner\nEND OF PETITION",
      "type": "application/pdf"
    }
  },
  "f7a2f0e4-2e3b-425f-9b51-a99ade178d6b": {
    "2b05461d-9d09-4a5b-bc0e-ecce5b3f2c40": {
      "name": "CONSTITUTIONAL PETITION.pdf",
      "content": "IN THE HIGH COURT OF KENYA AT\nNAIROBI\nCONSTITUTIONAL AND JUDICIAL REVIEW DIVISION\nPETITION NO. 347 OF 2024\nBETWEEN\nMARY WANJIKU KAMAU .................................................... PETITIONER\nAND\nTHE COUNTY GOVERNMENT OF NAIROBI ................ 1ST RESPONDENT\nTHE ATTORNEY GENERAL ................................................ 2ND RESPONDENT\nTHE NAIROBI CITY COUNTY ASSEMBLY .................. 3RD RESPONDENT\nCONSTITUTIONAL PETITION\n(Under Articles 22, 23, 43, 165(3)(d) of the Constitution of Kenya, 2010 and Section 7 of the\nEnvironment and Land Court Act, 2011)\nA. PARTIES TO THE PETITION\n1. THE PETITIONER\n1.1 The Petitioner, MARY WANJIKU KAMAU, is an adult Kenyan citizen residing in Kibera,\nNairobi County, within the Republic of Kenya. She is a small-scale trader operating a\nvegetable stall at the Toi Market and a mother of three children.\n1.2 The Petitioner brings this Petition in her own interest and in the public interest pursuant\nto Article 22(1) and (2) of the Constitution, seeking to enforce fundamental rights and\nfreedoms guaranteed under the Bill of Rights.\n2. THE RESPONDENTS\n2.1 The 1st Respondent, THE COUNTY GOVERNMENT OF NAIROBI, is a County\nGovernment established under Article 176 of the Constitution with its principal offices at City\nHall, Nairobi. The 1st Respondent has constitutional and statutory obligations to deliver\nservices and protect the rights of residents within Nairobi County.\n2.2 The 2nd Respondent, THE ATTORNEY GENERAL, is the principal legal advisor to the\nGovernment of Kenya appointed under Article 156 of the Constitution and is sued in his\ncapacity as representative of the National Government.\n2.3 The 3rd Respondent, THE NAIROBI CITY COUNTY ASSEMBLY, is the legislative arm of\nthe County Government established under Article 176(2) of the Constitution with\nresponsibility for making laws for the County.\nB. BACKGROUND AND FACTS\n3. FACTUAL MATRIX\n3.1 The Petitioner has resided in Kibera, Nairobi County, for the past fifteen (15) years\ntogether with her three children aged 8, 11, and 14 years.\n3.2 Kibera is one of the largest informal settlements in Africa, home to approximately\n250,000 residents who live in conditions of extreme poverty and deprivation.\n3.3 On or about 15th March 2024, the 3rd Respondent passed The Nairobi City County\nInformal Settlements (Regulation and Control) Act, 2024 (\"the impugned Act\"), which was\nassented to by the County Governor on 28th March 2024.\n3.4 The impugned Act purports to regulate informal settlements within Nairobi County and\ncontains the following key provisions:\na) Section 7: Prohibits the construction, modification, or occupation of any structure in\ndesignated informal settlements without a permit from the County Government.\nb) Section 12: Empowers County Enforcement Officers to demolish any structure deemed\n\"illegal\" or \"non-compliant\" without a court order.\nc) Section 15: Imposes a mandatory permit fee of KES 50,000 for existing structures and\nKES 75,000 for new structures in informal settlements.\nd) Section 18: Provides that failure to obtain a permit within 90 days of the Act's\ncommencement renders the structure illegal and subject to immediate demolition.\ne) Section 21: Excludes any right to compensation for demolished structures.\n3.5 On 10th July 2024, the Petitioner received a notice from the 1st Respondent's\nEnforcement Department stating that her dwelling structure was in violation of the impugned\nAct and would be demolished on 25th July 2024 unless she obtained the requisite permit.\n3.6 The Petitioner attempted to apply for the permit but was unable to raise the KES 50,000\nfee, which represents approximately eight months of her income from her vegetable stall.\n3.7 On 25th July 2024, at approximately 6:00 AM, County Enforcement Officers,\naccompanied by police officers, arrived at Kibera and proceeded to demolish approximately\n200 structures, including the Petitioner's home.\n3.8 The demolition was conducted without any court order and without providing alternative\naccommodation or compensation to the affected residents.\n3.9 The Petitioner and her children have since been living in a temporary shelter constructed\nfrom salvaged materials and are exposed to the elements, with no access to adequate\nsanitation or security.\n3.10 The Petitioner has suffered significant psychological trauma, and her children have\nbeen unable to attend school regularly due to lack of stable housing.\nC. CONSTITUTIONAL AND LEGAL VIOLATIONS\n4. VIOLATION OF THE RIGHT TO ACCESSIBLE AND ADEQUATE\nHOUSING (ARTICLE 43(1)(b))\n4.1 Article 43(1)(b) of the Constitution guarantees every person \"the right to accessible and\nadequate housing, and to reasonable standards of sanitation.\"\n4.2 The impugned Act and the subsequent demolitions have directly violated this\nconstitutional right by:\na) Rendering the Petitioner and her family homeless without providing alternative\naccommodation;\nb) Imposing prohibitive permit fees that are beyond the means of informal settlement\nresidents, thereby making housing inaccessible;\nc) Failing to progressively realize the right to housing as required under Article 21(2) of the\nConstitution.\n4.3 In Satrose Ayuma & 11 Others v Registered Trustees of the Kenya Railways Staff\nRetirement Benefits Scheme & 2 Others [2016] eKLR, the Court of Appeal held that:\n\"The right to accessible and adequate housing under Article 43(1)(b) is not\nmerely a right to shelter but encompasses security of tenure, availability of\nservices, affordability, habitability, accessibility, location and cultural adequacy.\"\n4.4 The 1st Respondent has failed to provide any alternative housing or resettlement plan for\nthe affected residents, thereby violating the progressive realization principle.\n5. VIOLATION OF THE RIGHT TO HUMAN DIGNITY (ARTICLE 28)\n5.1 Article 28 of the Constitution provides that \"Every person has inherent dignity and the\nright to have that dignity respected and protected.\"\n5.2 The demolition of the Petitioner's home in the manner conducted, leaving her and her\nchildren exposed to the elements without shelter, has violated her fundamental right to\ndignity.\n5.3 In Francis Karioko Muruatetu & Another v Republic [2017] eKLR, the Supreme Court\nemphasized that:\n\"Human dignity is the foundation of all human rights and must be respected and\nprotected in all circumstances.\"\n5.4 The treatment of the Petitioner and other Kibera residents as though their homes and\nlives are disposable constitutes a grave affront to human dignity.\n6. VIOLATION OF THE RIGHT TO FAIR ADMINISTRATIVE ACTION\n(ARTICLE 47)\n6.1 Article 47 of the Constitution guarantees every person the right to administrative action\nthat is expeditious, efficient, lawful, reasonable, and procedurally fair.\n6.2 Section 12 of the impugned Act authorizes demolitions without a court order, thereby\nviolating the principles of fair administrative action by:\na) Failing to provide an opportunity for affected persons to be heard before demolition;\nb) Failing to provide reasons for the administrative decision to demolish;\nc) Denying affected persons the right to seek judicial review before the administrative action\nis executed.\n6.3 In Anarita Karimi Njeru v Republic [1979] eKLR, the Court of Appeal established the\nduty to afford a hearing before adverse administrative action, stating:\n\"The rules of natural justice require that a person be given notice and an\nopportunity to be heard before a decision affecting their rights is made.\"\n6.4 The 1st Respondent proceeded with demolitions without providing individual hearings or\nany meaningful opportunity for affected residents to present their cases.\n7. VIOLATION OF CHILDREN'S RIGHTS (ARTICLE 53)\n7.1 Article 53(1) of the Constitution provides that every child has the right to basic nutrition,\nshelter, basic health care, and education.\n7.2 The Petitioner's three children have been deprived of adequate shelter, their education\nhas been disrupted, and they have been exposed to health hazards as a result of the\ndemolition.\n7.3 In CMS & 12 Others v Attorney General & 2 Others [2020] eKLR, the High Court held\nthat:\n\"The State has an obligation to take positive measures to protect children's\nrights, and any action that exposes children to harm or deprivation violates\nArticle 53.\"\n7.4 The 1st Respondent failed to conduct any child impact assessment before undertaking\nthe demolitions, contrary to the principles in the Children Act, 2022.\n8. VIOLATION OF THE RIGHT TO PROPERTY (ARTICLE 40)\n8.1 Article 40(1) of the Constitution protects every person's right to own property either\nindividually or in association with others.\n8.2 Article 40(3) provides that the State shall not deprive a person of property without\ncompensation.\n8.3 The Petitioner had possessory rights over her dwelling and the improvements she made\nto it over fifteen years, which constitute property within the meaning of Article 40.\n8.4 In Mitubell Welfare Society v Kenya Airports Authority & 2 Others [2013] eKLR, the\nSupreme Court recognized that:\n\"Property rights extend beyond formal title to include possessory rights and\nlegitimate expectations of continued occupation.\"\n8.5 Section 21 of the impugned Act, which excludes compensation for demolished\nstructures, is unconstitutional and void as it violates Article 40(3).\n9. VIOLATION OF EQUALITY AND FREEDOM FROM DISCRIMINATION\n(ARTICLE 27)\n9.1 Article 27(1) provides that every person is equal before the law and has the right to equal\nprotection and equal benefit of the law.\n9.2 The impugned Act disproportionately affects poor and marginalized communities in\ninformal settlements while residents of formal housing areas are not subject to similar\narbitrary regulations or demolitions.\n9.3 The permit fees of KES 50,000-75,000 are discriminatory as they are unaffordable to\ninformal settlement residents whose average monthly income is approximately KES 6,000.\n9.4 In Federation of Women Lawyers (FIDA-K) & 5 Others v Attorney General &\nAnother [2019] eKLR, the Constitutional Court stated:\n\"Discrimination can occur through laws that are facially neutral but have a\ndisproportionate impact on marginalized groups.\"\n9.5 The impugned Act constitutes indirect discrimination against the poor and violates Article\n27.\n10. VIOLATION OF THE PRINCIPLE OF PUBLIC PARTICIPATION\n(ARTICLE 10 AND 196)\n10.1 Article 10(2)(a) of the Constitution establishes public participation as a national value\nand principle of governance.\n10.2 Article 196(1) specifically requires County Governments to conduct public participation\nin the exercise of their powers and performance of functions.\n10.3 The 3rd Respondent enacted the impugned Act without meaningful public participation,\nparticularly without consulting the residents of informal settlements who would be directly\naffected.\n10.4 In Doctors for Life International v Speaker of the National Assembly & Others\n(CCT 12/05) [2006] ZACC 11 (a persuasive South African authority frequently cited in\nKenya), the Constitutional Court held that:\n\"Public participation must be meaningful, and those most affected by legislation\nmust be given a reasonable opportunity to know about the issues and to have\nan adequate say.\"\n10.5 The 1st and 3rd Respondents failed to conduct any consultative forums in Kibera or\nother informal settlements before enacting the law.\nD. APPLICABLE LAW\n11. CONSTITUTIONAL PROVISIONS\n11.1 The following provisions of the Constitution of Kenya, 2010 are directly applicable:\nArticle 10 – National values and principles of governance, including human dignity, equity,\nsocial justice, and public participation.\nArticle 19(2) – The purpose of recognizing and protecting human rights and fundamental\nfreedoms is to preserve the dignity of individuals and communities.\nArticle 20 – Application of the Bill of Rights, particularly:\n● Article 20(2): The State and every State organ must respect, protect, promote and\nfulfill the rights in the Bill of Rights.\n● Article 20(4): The State must take legislative, policy and other measures, including\nsetting standards, to achieve the progressive realization of economic and social\nrights.\nArticle 21 – Implementation of rights and fundamental freedoms, which places an obligation\non the State to observe, respect, protect, promote and fulfill the rights in the Bill of Rights.\nArticle 22 – Enforcement of the Bill of Rights, which empowers any person to approach the\nHigh Court alleging that a right has been denied, violated or infringed.\nArticle 23 – Authority of courts to uphold and enforce the Bill of Rights, including granting\nappropriate relief and awarding compensation.\nArticle 27 – Equality and freedom from discrimination.\nArticle 28 – Right to human dignity.\nArticle 40 – Right to property, including protection against deprivation without compensation.\nArticle 43 – Economic and social rights, specifically:\n● Article 43(1)(b): The right to accessible and adequate housing and reasonable\nstandards of sanitation.\nArticle 47 – Right to fair administrative action.\nArticle 53 – Children's rights, including the right to shelter, education, and protection from\nharm.\nArticle 165(3)(d) – Jurisdiction of the High Court to hear constitutional matters.\nArticle 176 – Establishment and powers of County Governments.\nArticle 196 – Public participation in County Government functions.\n12. STATUTORY LAW\n12.1 The Fair Administrative Action Act, No. 4 of 2015\nSection 4 provides that administrative action must be:\n● Procedurally fair\n● Expeditious, efficient, lawful, reasonable and proportionate\nSection 6 requires that before making a decision affecting a person's rights, the administrator\nmust give notice and opportunity to make representations.\n12.2 The Children Act, 2022\nSection 9 places a duty on the State to progressively implement children's rights, including\nthe right to shelter.\n12.3 The Environment and Land Court Act, 2011\nSection 13 grants the Court jurisdiction over matters relating to environmental and land use\nplanning.\n13. INTERNATIONAL LAW\n13.1 Pursuant to Article 2(5) and (6) of the Constitution, general rules of international law\nand treaties ratified by Kenya form part of Kenyan law.\n13.2 International Covenant on Economic, Social and Cultural Rights (ICESCR)\nKenya ratified the ICESCR in 1972. Article 11(1) recognizes \"the right of everyone to an\nadequate standard of living for himself and his family, including adequate food, clothing and\nhousing.\"\nGeneral Comment No. 4 on the right to adequate housing emphasizes security of tenure,\nprotection against forced evictions, and the requirement of alternative accommodation.\n13.3 The African Charter on Human and Peoples' Rights\nKenya ratified the Charter in 1992. Article 14 protects the right to property, and Article 18\nrequires the State to ensure the protection of the family.\n13.4 Convention on the Rights of the Child (CRC)\nKenya ratified the CRC in 1990. Article 27 recognizes the right of every child to a standard of\nliving adequate for the child's physical, mental, spiritual, moral and social development.\nE. GROUNDS OF THE PETITION\n14. ILLEGALITY AND UNCONSTITUTIONALITY OF THE IMPUGNED ACT\n14.1 The impugned Act is unconstitutional, illegal, null and void ab initio for the following\nreasons:\na) It violates Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) It was enacted without public participation in violation of Articles 10 and 196 of the\nConstitution;\nc) It imposes disproportionate and discriminatory financial burdens on the poor;\nd) It authorizes arbitrary administrative action without judicial oversight;\ne) It excludes compensation in violation of Article 40(3);\nf) It fails to provide for alternative accommodation or progressive realization of housing\nrights.\n15. ILLEGALITY OF THE DEMOLITIONS\n15.1 The demolitions conducted on 25th July 2024 were illegal, unconstitutional and violated\nthe Petitioner's fundamental rights because:\na) They were conducted without court orders;\nb) No individual notice or hearing was provided to affected residents;\nc) No alternative accommodation was provided;\nd) No compensation was offered;\ne) The actions violated the principles of fair administrative action under Article 47;\nf) The demolitions exposed children to harm in violation of Article 53;\ng) The actions violated international law standards on forced evictions.\n16. FAILURE OF CONSTITUTIONAL OBLIGATIONS\n16.1 The Respondents have failed in their constitutional obligations under Article 21 to\nrespect, protect, promote and fulfill the rights in the Bill of Rights.\n16.2 The Respondents have failed to progressively realize the right to housing under Article\n43 and have instead taken retrogressive measures.\nF. RELIEFS SOUGHT\n17. WHEREFORE, the Petitioner humbly prays that this Honourable\nCourt be pleased to:\nDECLARATIONS\na) DECLARE that Sections 7, 12, 15, 18, and 21 of The Nairobi City County Informal\nSettlements (Regulation and Control) Act, 2024 are unconstitutional, null and void for\nviolating Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) DECLARE that the demolition of the Petitioner's dwelling on 25th July 2024 was illegal,\nunconstitutional and violated the Petitioner's rights under Articles 28, 40, 43, 47, and 53 of\nthe Constitution;\nc) DECLARE that the 1st and 3rd Respondents violated the Petitioner's right to public\nparticipation under Articles 10 and 196 of the Constitution by enacting the impugned Act\nwithout meaningful consultation with informal settlement residents;\nd) DECLARE that the Respondents have a constitutional obligation to progressively realize\nthe right to adequate housing under Article 43(1)(b) and must take positive measures to\nprovide housing for informal settlement residents;\nORDERS\ne) ORDER that the 1st Respondent immediately provide the Petitioner with alternative\nadequate temporary housing pending permanent resettlement;\nf) ORDER the 1st Respondent to compensate the Petitioner for the demolition of her\ndwelling and for the violation of her constitutional rights;\ng) ORDER the 1st and 3rd Respondents to develop, within six (6) months, a comprehensive\ninformal settlements upgrading policy that complies with constitutional requirements,\nincludes public participation, provides for security of tenure, and progressively realizes\nhousing rights;\nh) ORDER the 1st Respondent to immediately cease all further demolitions in informal\nsettlements until a constitutional policy framework is established;\ni) ISSUE a permanent injunction restraining the Respondents from implementing Sections 7,\n12, 15, 18, and 21 of the impugned Act;\nGENERAL RELIEF\nj) AWARD general and aggravated damages to the Petitioner for violation of her\nconstitutional rights;\nk) AWARD the costs of this Petition;\nl) GRANT any other relief that this Honourable Court may deem just and appropriate.\nG. CERTIFICATION OF URGENCY\n18. This Petition is urgent and requires immediate hearing because:\na) The Petitioner and her children are currently homeless and living in dehumanizing\nconditions;\nb) The children's health, safety, and education are at immediate risk;\nc) The 1st Respondent continues to conduct demolitions in informal settlements, affecting\nthousands of residents;\nd) The rainy season is approaching, which will further expose homeless residents to\nlife-threatening conditions;\ne) Irreparable harm is being suffered daily by the Petitioner and other affected persons.\nH. NOTICE TO THE ATTORNEY GENERAL\n19. Notice of this Constitutional Petition has been duly served upon the Attorney General\npursuant to Article 165(4) of the Constitution and Order 34 Rule 5 of the Constitution\nof Kenya (Protection of Rights and Fundamental Freedoms) Practice and Procedure\nRules, 2013.\nDATED at Nairobi this 15th day of August, 2024\nFILED by:\nKAMAU & ASSOCIATES ADVOCATES\nAdvocates for the Petitioner\nP.O. Box 12345-00100\nNairobi, Kenya\nTel: +254 712 345 678\nEmail: info@kamauadvocates.co.ke\nSIGNED:\nJAMES KAMAU MWANGI\nAdvocate for the Petitioner\nSCHEDULE OF DOCUMENTS\n1. Copy of the Petitioner's National Identity Card\n2. Copy of The Nairobi City County Informal Settlements (Regulation and Control) Act,\n2024\n3. Demolition Notice dated 10th July 2024\n4. Photographs of the Petitioner's demolished dwelling\n5. Photographs of current temporary shelter\n6. Medical report on the psychological impact on the Petitioner's children\n7. Affidavit of service on the Attorney General\n8. List of 200 affected households in Kibera\nSUPPORTING AFFIDAVIT\nI, MARY WANJIKU KAMAU, of P.O. Box XXXX, Nairobi in the Republic of Kenya, do\nhereby make oath and state as follows:\n1. THAT I am the Petitioner herein and am conversant with the facts of this case.\n2. THAT the facts deposed to in this Affidavit are true to the best of my knowledge,\ninformation and belief.\n3. THAT the contents of the foregoing Petition are true and accurate.\n4. THAT I have resided in Kibera for fifteen years and have made my dwelling there my\nfamily home.\n5. THAT I am a small-scale trader earning approximately KES 6,000 per month from\nselling vegetables at Toi Market.\n6. THAT I used my limited savings over many years to improve my dwelling with iron\nsheets, a proper door, and a small extension for my children.\n7. THAT on 10th July 2024, I received a demolition notice giving me 15 days to obtain a\npermit costing KES 50,000.\n8. THAT I attempted to raise the money but it was impossible as it represents more than\neight months of my income.\n9. THAT on 25th July 2024, County officers demolished my home without giving me a\nchance to remove my belongings or to be heard.\n10. THAT my children and I have suffered greatly since the demolition and are living in\ninhumane conditions.\n11. THAT I was never consulted before the Act was passed and neither were other\nresidents of Kibera.\n12. THAT I bring this Petition in good faith to protect my rights and those of my children.\nSWORN at Nairobi\nthis 15th day of August 2024\nBEFORE ME:\nCOMMISSIONER FOR OATHS\nMARY WANJIKU KAMAU\nPetitioner\nEND OF PETITION",
      "type": "application/pdf"
    },
    "brief_Summary_of_Arguments_Mary_Wanjiku_v_County_Governm_2025-12-20T17-46-32.pdf": {
      "name": "brief_Summary_of_Arguments_Mary_Wanjiku_v_County_Governm_2025-12-20T17-46-32.pdf",
      "content": "**Arguments by Counsel for Mary Wanjiku:**\n\n1.  **Violation of Article 43 (Right to Housing):** The County Government demolished Ms. Wanjiku's home without a court order, compensation, or providing alternative shelter, directly contravening the constitutional right to housing.\n2.  **Violation of Article 28 (Right to Dignity):** The forced demolition, leaving a mother and her three children homeless and exposed, constitutes a profound violation of their inherent human dignity, as established by *Francis Muruatetu*. Counsel argues that dignity must be respected in all circumstances, even for those alleged to have broken the law.\n3.  **Violation of Article 47 (Right to Fair Administrative Action):** The County provided only a 15-day notice and proceeded with demolition without any opportunity for Ms. Wanjiku to be heard. This violates the principle of procedural fairness, as reinforced by *Anarita Karimi Njeru*, which mandates that individuals be given a chance to explain their situation before decisions affecting their rights are made. It is further argued that Section 12 of the County Act, if it allows demolitions without court orders, is unconstitutional on its face.\n4.  **Violation of Article 53 (Protection of Children's Rights):** The demolition occurred with Ms. Wanjiku's children inside, directly impacting their well-being and right to shelter, leaving them vulnerable.\n5.  **Unreasonable Demands:** The demand for a KES 50,000 permit fee, equivalent to eight months of Ms. Wanjiku's income, was an impossible burden, making compliance unattainable.\n\n**Arguments by Opposing Counsel (for County Government):**\n\n1.  **Legality of the Structure:** The central issue is the legal standing of Ms. Wanjiku's home. Opposing Counsel questions whether the structure was built in accordance with urban planning regulations and whether the land was lawfully occupied.\n2.  **County's Constitutional Mandate:** The County Government has a legitimate and constitutional responsibility for urban planning, management of public land, and enforcement of planning laws. This mandate involves balancing individual rights with the broader public interest in orderly urban development and resource management.\n3.  **Conditional Acceptance of Procedural Due Process:** While acknowledging the importance of Article 47 and procedural fairness, Opposing Counsel argues that the County may have acted under provisions it deemed lawful within its enabling legislation. There could be circumstances, particularly concerning public safety or illegal structures on public land, where immediate action might be contemplated under specific statutory powers.\n4.  **Constitutionality of Section 12:** Opposing Counsel contends that without the specific wording of Section 12 of the County Act, it is premature to declare it unconstitutional on its face. A thorough legal analysis is required.\n5.  **Dignity vs. Compliance with Law:** The right to dignity, while paramount, cannot be invoked to circumvent valid land use and building regulations. The County's actions, while needing to adhere to due process, are rooted in a legitimate exercise of its constitutional duties to ensure public order and compliance.",
      "type": "generated"
    }
  },
  "e1bbaf0c-1ca5-4499-a09e-7b64b69eb873": {
    "8ef73835-d4e8-40c8-a7fd-8ad1c17dd162": {
      "name": "CONSTITUTIONAL PETITION.pdf",
      "content": "IN THE HIGH COURT OF KENYA AT\nNAIROBI\nCONSTITUTIONAL AND JUDICIAL REVIEW DIVISION\nPETITION NO. 347 OF 2024\nBETWEEN\nMARY WANJIKU KAMAU .................................................... PETITIONER\nAND\nTHE COUNTY GOVERNMENT OF NAIROBI ................ 1ST RESPONDENT\nTHE ATTORNEY GENERAL ................................................ 2ND RESPONDENT\nTHE NAIROBI CITY COUNTY ASSEMBLY .................. 3RD RESPONDENT\nCONSTITUTIONAL PETITION\n(Under Articles 22, 23, 43, 165(3)(d) of the Constitution of Kenya, 2010 and Section 7 of the\nEnvironment and Land Court Act, 2011)\nA. PARTIES TO THE PETITION\n1. THE PETITIONER\n1.1 The Petitioner, MARY WANJIKU KAMAU, is an adult Kenyan citizen residing in Kibera,\nNairobi County, within the Republic of Kenya. She is a small-scale trader operating a\nvegetable stall at the Toi Market and a mother of three children.\n1.2 The Petitioner brings this Petition in her own interest and in the public interest pursuant\nto Article 22(1) and (2) of the Constitution, seeking to enforce fundamental rights and\nfreedoms guaranteed under the Bill of Rights.\n2. THE RESPONDENTS\n2.1 The 1st Respondent, THE COUNTY GOVERNMENT OF NAIROBI, is a County\nGovernment established under Article 176 of the Constitution with its principal offices at City\nHall, Nairobi. The 1st Respondent has constitutional and statutory obligations to deliver\nservices and protect the rights of residents within Nairobi County.\n2.2 The 2nd Respondent, THE ATTORNEY GENERAL, is the principal legal advisor to the\nGovernment of Kenya appointed under Article 156 of the Constitution and is sued in his\ncapacity as representative of the National Government.\n2.3 The 3rd Respondent, THE NAIROBI CITY COUNTY ASSEMBLY, is the legislative arm of\nthe County Government established under Article 176(2) of the Constitution with\nresponsibility for making laws for the County.\nB. BACKGROUND AND FACTS\n3. FACTUAL MATRIX\n3.1 The Petitioner has resided in Kibera, Nairobi County, for the past fifteen (15) years\ntogether with her three children aged 8, 11, and 14 years.\n3.2 Kibera is one of the largest informal settlements in Africa, home to approximately\n250,000 residents who live in conditions of extreme poverty and deprivation.\n3.3 On or about 15th March 2024, the 3rd Respondent passed The Nairobi City County\nInformal Settlements (Regulation and Control) Act, 2024 (\"the impugned Act\"), which was\nassented to by the County Governor on 28th March 2024.\n3.4 The impugned Act purports to regulate informal settlements within Nairobi County and\ncontains the following key provisions:\na) Section 7: Prohibits the construction, modification, or occupation of any structure in\ndesignated informal settlements without a permit from the County Government.\nb) Section 12: Empowers County Enforcement Officers to demolish any structure deemed\n\"illegal\" or \"non-compliant\" without a court order.\nc) Section 15: Imposes a mandatory permit fee of KES 50,000 for existing structures and\nKES 75,000 for new structures in informal settlements.\nd) Section 18: Provides that failure to obtain a permit within 90 days of the Act's\ncommencement renders the structure illegal and subject to immediate demolition.\ne) Section 21: Excludes any right to compensation for demolished structures.\n3.5 On 10th July 2024, the Petitioner received a notice from the 1st Respondent's\nEnforcement Department stating that her dwelling structure was in violation of the impugned\nAct and would be demolished on 25th July 2024 unless she obtained the requisite permit.\n3.6 The Petitioner attempted to apply for the permit but was unable to raise the KES 50,000\nfee, which represents approximately eight months of her income from her vegetable stall.\n3.7 On 25th July 2024, at approximately 6:00 AM, County Enforcement Officers,\naccompanied by police officers, arrived at Kibera and proceeded to demolish approximately\n200 structures, including the Petitioner's home.\n3.8 The demolition was conducted without any court order and without providing alternative\naccommodation or compensation to the affected residents.\n3.9 The Petitioner and her children have since been living in a temporary shelter constructed\nfrom salvaged materials and are exposed to the elements, with no access to adequate\nsanitation or security.\n3.10 The Petitioner has suffered significant psychological trauma, and her children have\nbeen unable to attend school regularly due to lack of stable housing.\nC. CONSTITUTIONAL AND LEGAL VIOLATIONS\n4. VIOLATION OF THE RIGHT TO ACCESSIBLE AND ADEQUATE\nHOUSING (ARTICLE 43(1)(b))\n4.1 Article 43(1)(b) of the Constitution guarantees every person \"the right to accessible and\nadequate housing, and to reasonable standards of sanitation.\"\n4.2 The impugned Act and the subsequent demolitions have directly violated this\nconstitutional right by:\na) Rendering the Petitioner and her family homeless without providing alternative\naccommodation;\nb) Imposing prohibitive permit fees that are beyond the means of informal settlement\nresidents, thereby making housing inaccessible;\nc) Failing to progressively realize the right to housing as required under Article 21(2) of the\nConstitution.\n4.3 In Satrose Ayuma & 11 Others v Registered Trustees of the Kenya Railways Staff\nRetirement Benefits Scheme & 2 Others [2016] eKLR, the Court of Appeal held that:\n\"The right to accessible and adequate housing under Article 43(1)(b) is not\nmerely a right to shelter but encompasses security of tenure, availability of\nservices, affordability, habitability, accessibility, location and cultural adequacy.\"\n4.4 The 1st Respondent has failed to provide any alternative housing or resettlement plan for\nthe affected residents, thereby violating the progressive realization principle.\n5. VIOLATION OF THE RIGHT TO HUMAN DIGNITY (ARTICLE 28)\n5.1 Article 28 of the Constitution provides that \"Every person has inherent dignity and the\nright to have that dignity respected and protected.\"\n5.2 The demolition of the Petitioner's home in the manner conducted, leaving her and her\nchildren exposed to the elements without shelter, has violated her fundamental right to\ndignity.\n5.3 In Francis Karioko Muruatetu & Another v Republic [2017] eKLR, the Supreme Court\nemphasized that:\n\"Human dignity is the foundation of all human rights and must be respected and\nprotected in all circumstances.\"\n5.4 The treatment of the Petitioner and other Kibera residents as though their homes and\nlives are disposable constitutes a grave affront to human dignity.\n6. VIOLATION OF THE RIGHT TO FAIR ADMINISTRATIVE ACTION\n(ARTICLE 47)\n6.1 Article 47 of the Constitution guarantees every person the right to administrative action\nthat is expeditious, efficient, lawful, reasonable, and procedurally fair.\n6.2 Section 12 of the impugned Act authorizes demolitions without a court order, thereby\nviolating the principles of fair administrative action by:\na) Failing to provide an opportunity for affected persons to be heard before demolition;\nb) Failing to provide reasons for the administrative decision to demolish;\nc) Denying affected persons the right to seek judicial review before the administrative action\nis executed.\n6.3 In Anarita Karimi Njeru v Republic [1979] eKLR, the Court of Appeal established the\nduty to afford a hearing before adverse administrative action, stating:\n\"The rules of natural justice require that a person be given notice and an\nopportunity to be heard before a decision affecting their rights is made.\"\n6.4 The 1st Respondent proceeded with demolitions without providing individual hearings or\nany meaningful opportunity for affected residents to present their cases.\n7. VIOLATION OF CHILDREN'S RIGHTS (ARTICLE 53)\n7.1 Article 53(1) of the Constitution provides that every child has the right to basic nutrition,\nshelter, basic health care, and education.\n7.2 The Petitioner's three children have been deprived of adequate shelter, their education\nhas been disrupted, and they have been exposed to health hazards as a result of the\ndemolition.\n7.3 In CMS & 12 Others v Attorney General & 2 Others [2020] eKLR, the High Court held\nthat:\n\"The State has an obligation to take positive measures to protect children's\nrights, and any action that exposes children to harm or deprivation violates\nArticle 53.\"\n7.4 The 1st Respondent failed to conduct any child impact assessment before undertaking\nthe demolitions, contrary to the principles in the Children Act, 2022.\n8. VIOLATION OF THE RIGHT TO PROPERTY (ARTICLE 40)\n8.1 Article 40(1) of the Constitution protects every person's right to own property either\nindividually or in association with others.\n8.2 Article 40(3) provides that the State shall not deprive a person of property without\ncompensation.\n8.3 The Petitioner had possessory rights over her dwelling and the improvements she made\nto it over fifteen years, which constitute property within the meaning of Article 40.\n8.4 In Mitubell Welfare Society v Kenya Airports Authority & 2 Others [2013] eKLR, the\nSupreme Court recognized that:\n\"Property rights extend beyond formal title to include possessory rights and\nlegitimate expectations of continued occupation.\"\n8.5 Section 21 of the impugned Act, which excludes compensation for demolished\nstructures, is unconstitutional and void as it violates Article 40(3).\n9. VIOLATION OF EQUALITY AND FREEDOM FROM DISCRIMINATION\n(ARTICLE 27)\n9.1 Article 27(1) provides that every person is equal before the law and has the right to equal\nprotection and equal benefit of the law.\n9.2 The impugned Act disproportionately affects poor and marginalized communities in\ninformal settlements while residents of formal housing areas are not subject to similar\narbitrary regulations or demolitions.\n9.3 The permit fees of KES 50,000-75,000 are discriminatory as they are unaffordable to\ninformal settlement residents whose average monthly income is approximately KES 6,000.\n9.4 In Federation of Women Lawyers (FIDA-K) & 5 Others v Attorney General &\nAnother [2019] eKLR, the Constitutional Court stated:\n\"Discrimination can occur through laws that are facially neutral but have a\ndisproportionate impact on marginalized groups.\"\n9.5 The impugned Act constitutes indirect discrimination against the poor and violates Article\n27.\n10. VIOLATION OF THE PRINCIPLE OF PUBLIC PARTICIPATION\n(ARTICLE 10 AND 196)\n10.1 Article 10(2)(a) of the Constitution establishes public participation as a national value\nand principle of governance.\n10.2 Article 196(1) specifically requires County Governments to conduct public participation\nin the exercise of their powers and performance of functions.\n10.3 The 3rd Respondent enacted the impugned Act without meaningful public participation,\nparticularly without consulting the residents of informal settlements who would be directly\naffected.\n10.4 In Doctors for Life International v Speaker of the National Assembly & Others\n(CCT 12/05) [2006] ZACC 11 (a persuasive South African authority frequently cited in\nKenya), the Constitutional Court held that:\n\"Public participation must be meaningful, and those most affected by legislation\nmust be given a reasonable opportunity to know about the issues and to have\nan adequate say.\"\n10.5 The 1st and 3rd Respondents failed to conduct any consultative forums in Kibera or\nother informal settlements before enacting the law.\nD. APPLICABLE LAW\n11. CONSTITUTIONAL PROVISIONS\n11.1 The following provisions of the Constitution of Kenya, 2010 are directly applicable:\nArticle 10 – National values and principles of governance, including human dignity, equity,\nsocial justice, and public participation.\nArticle 19(2) – The purpose of recognizing and protecting human rights and fundamental\nfreedoms is to preserve the dignity of individuals and communities.\nArticle 20 – Application of the Bill of Rights, particularly:\n● Article 20(2): The State and every State organ must respect, protect, promote and\nfulfill the rights in the Bill of Rights.\n● Article 20(4): The State must take legislative, policy and other measures, including\nsetting standards, to achieve the progressive realization of economic and social\nrights.\nArticle 21 – Implementation of rights and fundamental freedoms, which places an obligation\non the State to observe, respect, protect, promote and fulfill the rights in the Bill of Rights.\nArticle 22 – Enforcement of the Bill of Rights, which empowers any person to approach the\nHigh Court alleging that a right has been denied, violated or infringed.\nArticle 23 – Authority of courts to uphold and enforce the Bill of Rights, including granting\nappropriate relief and awarding compensation.\nArticle 27 – Equality and freedom from discrimination.\nArticle 28 – Right to human dignity.\nArticle 40 – Right to property, including protection against deprivation without compensation.\nArticle 43 – Economic and social rights, specifically:\n● Article 43(1)(b): The right to accessible and adequate housing and reasonable\nstandards of sanitation.\nArticle 47 – Right to fair administrative action.\nArticle 53 – Children's rights, including the right to shelter, education, and protection from\nharm.\nArticle 165(3)(d) – Jurisdiction of the High Court to hear constitutional matters.\nArticle 176 – Establishment and powers of County Governments.\nArticle 196 – Public participation in County Government functions.\n12. STATUTORY LAW\n12.1 The Fair Administrative Action Act, No. 4 of 2015\nSection 4 provides that administrative action must be:\n● Procedurally fair\n● Expeditious, efficient, lawful, reasonable and proportionate\nSection 6 requires that before making a decision affecting a person's rights, the administrator\nmust give notice and opportunity to make representations.\n12.2 The Children Act, 2022\nSection 9 places a duty on the State to progressively implement children's rights, including\nthe right to shelter.\n12.3 The Environment and Land Court Act, 2011\nSection 13 grants the Court jurisdiction over matters relating to environmental and land use\nplanning.\n13. INTERNATIONAL LAW\n13.1 Pursuant to Article 2(5) and (6) of the Constitution, general rules of international law\nand treaties ratified by Kenya form part of Kenyan law.\n13.2 International Covenant on Economic, Social and Cultural Rights (ICESCR)\nKenya ratified the ICESCR in 1972. Article 11(1) recognizes \"the right of everyone to an\nadequate standard of living for himself and his family, including adequate food, clothing and\nhousing.\"\nGeneral Comment No. 4 on the right to adequate housing emphasizes security of tenure,\nprotection against forced evictions, and the requirement of alternative accommodation.\n13.3 The African Charter on Human and Peoples' Rights\nKenya ratified the Charter in 1992. Article 14 protects the right to property, and Article 18\nrequires the State to ensure the protection of the family.\n13.4 Convention on the Rights of the Child (CRC)\nKenya ratified the CRC in 1990. Article 27 recognizes the right of every child to a standard of\nliving adequate for the child's physical, mental, spiritual, moral and social development.\nE. GROUNDS OF THE PETITION\n14. ILLEGALITY AND UNCONSTITUTIONALITY OF THE IMPUGNED ACT\n14.1 The impugned Act is unconstitutional, illegal, null and void ab initio for the following\nreasons:\na) It violates Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) It was enacted without public participation in violation of Articles 10 and 196 of the\nConstitution;\nc) It imposes disproportionate and discriminatory financial burdens on the poor;\nd) It authorizes arbitrary administrative action without judicial oversight;\ne) It excludes compensation in violation of Article 40(3);\nf) It fails to provide for alternative accommodation or progressive realization of housing\nrights.\n15. ILLEGALITY OF THE DEMOLITIONS\n15.1 The demolitions conducted on 25th July 2024 were illegal, unconstitutional and violated\nthe Petitioner's fundamental rights because:\na) They were conducted without court orders;\nb) No individual notice or hearing was provided to affected residents;\nc) No alternative accommodation was provided;\nd) No compensation was offered;\ne) The actions violated the principles of fair administrative action under Article 47;\nf) The demolitions exposed children to harm in violation of Article 53;\ng) The actions violated international law standards on forced evictions.\n16. FAILURE OF CONSTITUTIONAL OBLIGATIONS\n16.1 The Respondents have failed in their constitutional obligations under Article 21 to\nrespect, protect, promote and fulfill the rights in the Bill of Rights.\n16.2 The Respondents have failed to progressively realize the right to housing under Article\n43 and have instead taken retrogressive measures.\nF. RELIEFS SOUGHT\n17. WHEREFORE, the Petitioner humbly prays that this Honourable\nCourt be pleased to:\nDECLARATIONS\na) DECLARE that Sections 7, 12, 15, 18, and 21 of The Nairobi City County Informal\nSettlements (Regulation and Control) Act, 2024 are unconstitutional, null and void for\nviolating Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) DECLARE that the demolition of the Petitioner's dwelling on 25th July 2024 was illegal,\nunconstitutional and violated the Petitioner's rights under Articles 28, 40, 43, 47, and 53 of\nthe Constitution;\nc) DECLARE that the 1st and 3rd Respondents violated the Petitioner's right to public\nparticipation under Articles 10 and 196 of the Constitution by enacting the impugned Act\nwithout meaningful consultation with informal settlement residents;\nd) DECLARE that the Respondents have a constitutional obligation to progressively realize\nthe right to adequate housing under Article 43(1)(b) and must take positive measures to\nprovide housing for informal settlement residents;\nORDERS\ne) ORDER that the 1st Respondent immediately provide the Petitioner with alternative\nadequate temporary housing pending permanent resettlement;\nf) ORDER the 1st Respondent to compensate the Petitioner for the demolition of her\ndwelling and for the violation of her constitutional rights;\ng) ORDER the 1st and 3rd Respondents to develop, within six (6) months, a comprehensive\ninformal settlements upgrading policy that complies with constitutional requirements,\nincludes public participation, provides for security of tenure, and progressively realizes\nhousing rights;\nh) ORDER the 1st Respondent to immediately cease all further demolitions in informal\nsettlements until a constitutional policy framework is established;\ni) ISSUE a permanent injunction restraining the Respondents from implementing Sections 7,\n12, 15, 18, and 21 of the impugned Act;\nGENERAL RELIEF\nj) AWARD general and aggravated damages to the Petitioner for violation of her\nconstitutional rights;\nk) AWARD the costs of this Petition;\nl) GRANT any other relief that this Honourable Court may deem just and appropriate.\nG. CERTIFICATION OF URGENCY\n18. This Petition is urgent and requires immediate hearing because:\na) The Petitioner and her children are currently homeless and living in dehumanizing\nconditions;\nb) The children's health, safety, and education are at immediate risk;\nc) The 1st Respondent continues to conduct demolitions in informal settlements, affecting\nthousands of residents;\nd) The rainy season is approaching, which will further expose homeless residents to\nlife-threatening conditions;\ne) Irreparable harm is being suffered daily by the Petitioner and other affected persons.\nH. NOTICE TO THE ATTORNEY GENERAL\n19. Notice of this Constitutional Petition has been duly served upon the Attorney General\npursuant to Article 165(4) of the Constitution and Order 34 Rule 5 of the Constitution\nof Kenya (Protection of Rights and Fundamental Freedoms) Practice and Procedure\nRules, 2013.\nDATED at Nairobi this 15th day of August, 2024\nFILED by:\nKAMAU & ASSOCIATES ADVOCATES\nAdvocates for the Petitioner\nP.O. Box 12345-00100\nNairobi, Kenya\nTel: +254 712 345 678\nEmail: info@kamauadvocates.co.ke\nSIGNED:\nJAMES KAMAU MWANGI\nAdvocate for the Petitioner\nSCHEDULE OF DOCUMENTS\n1. Copy of the Petitioner's National Identity Card\n2. Copy of The Nairobi City County Informal Settlements (Regulation and Control) Act,\n2024\n3. Demolition Notice dated 10th July 2024\n4. Photographs of the Petitioner's demolished dwelling\n5. Photographs of current temporary shelter\n6. Medical report on the psychological impact on the Petitioner's children\n7. Affidavit of service on the Attorney General\n8. List of 200 affected households in Kibera\nSUPPORTING AFFIDAVIT\nI, MARY WANJIKU KAMAU, of P.O. Box XXXX, Nairobi in the Republic of Kenya, do\nhereby make oath and state as follows:\n1. THAT I am the Petitioner herein and am conversant with the facts of this case.\n2. THAT the facts deposed to in this Affidavit are true to the best of my knowledge,\ninformation and belief.\n3. THAT the contents of the foregoing Petition are true and accurate.\n4. THAT I have resided in Kibera for fifteen years and have made my dwelling there my\nfamily home.\n5. THAT I am a small-scale trader earning approximately KES 6,000 per month from\nselling vegetables at Toi Market.\n6. THAT I used my limited savings over many years to improve my dwelling with iron\nsheets, a proper door, and a small extension for my children.\n7. THAT on 10th July 2024, I received a demolition notice giving me 15 days to obtain a\npermit costing KES 50,000.\n8. THAT I attempted to raise the money but it was impossible as it represents more than\neight months of my income.\n9. THAT on 25th July 2024, County officers demolished my home without giving me a\nchance to remove my belongings or to be heard.\n10. THAT my children and I have suffered greatly since the demolition and are living in\ninhumane conditions.\n11. THAT I was never consulted before the Act was passed and neither were other\nresidents of Kibera.\n12. THAT I bring this Petition in good faith to protect my rights and those of my children.\nSWORN at Nairobi\nthis 15th day of August 2024\nBEFORE ME:\nCOMMISSIONER FOR OATHS\nMARY WANJIKU KAMAU\nPetitioner\nEND OF PETITION",
      "type": "application/pdf"
    }
  },
  "982d816f-75f3-422d-87e0-2baaedcbdf68": {
    "b94b7734-9476-4d8a-b48b-bddfa031f051": {
      "name": "CONSTITUTIONAL PETITION.pdf",
      "content": "IN THE HIGH COURT OF KENYA AT\nNAIROBI\nCONSTITUTIONAL AND JUDICIAL REVIEW DIVISION\nPETITION NO. 347 OF 2024\nBETWEEN\nMARY WANJIKU KAMAU .................................................... PETITIONER\nAND\nTHE COUNTY GOVERNMENT OF NAIROBI ................ 1ST RESPONDENT\nTHE ATTORNEY GENERAL ................................................ 2ND RESPONDENT\nTHE NAIROBI CITY COUNTY ASSEMBLY .................. 3RD RESPONDENT\nCONSTITUTIONAL PETITION\n(Under Articles 22, 23, 43, 165(3)(d) of the Constitution of Kenya, 2010 and Section 7 of the\nEnvironment and Land Court Act, 2011)\nA. PARTIES TO THE PETITION\n1. THE PETITIONER\n1.1 The Petitioner, MARY WANJIKU KAMAU, is an adult Kenyan citizen residing in Kibera,\nNairobi County, within the Republic of Kenya. She is a small-scale trader operating a\nvegetable stall at the Toi Market and a mother of three children.\n1.2 The Petitioner brings this Petition in her own interest and in the public interest pursuant\nto Article 22(1) and (2) of the Constitution, seeking to enforce fundamental rights and\nfreedoms guaranteed under the Bill of Rights.\n2. THE RESPONDENTS\n2.1 The 1st Respondent, THE COUNTY GOVERNMENT OF NAIROBI, is a County\nGovernment established under Article 176 of the Constitution with its principal offices at City\nHall, Nairobi. The 1st Respondent has constitutional and statutory obligations to deliver\nservices and protect the rights of residents within Nairobi County.\n2.2 The 2nd Respondent, THE ATTORNEY GENERAL, is the principal legal advisor to the\nGovernment of Kenya appointed under Article 156 of the Constitution and is sued in his\ncapacity as representative of the National Government.\n2.3 The 3rd Respondent, THE NAIROBI CITY COUNTY ASSEMBLY, is the legislative arm of\nthe County Government established under Article 176(2) of the Constitution with\nresponsibility for making laws for the County.\nB. BACKGROUND AND FACTS\n3. FACTUAL MATRIX\n3.1 The Petitioner has resided in Kibera, Nairobi County, for the past fifteen (15) years\ntogether with her three children aged 8, 11, and 14 years.\n3.2 Kibera is one of the largest informal settlements in Africa, home to approximately\n250,000 residents who live in conditions of extreme poverty and deprivation.\n3.3 On or about 15th March 2024, the 3rd Respondent passed The Nairobi City County\nInformal Settlements (Regulation and Control) Act, 2024 (\"the impugned Act\"), which was\nassented to by the County Governor on 28th March 2024.\n3.4 The impugned Act purports to regulate informal settlements within Nairobi County and\ncontains the following key provisions:\na) Section 7: Prohibits the construction, modification, or occupation of any structure in\ndesignated informal settlements without a permit from the County Government.\nb) Section 12: Empowers County Enforcement Officers to demolish any structure deemed\n\"illegal\" or \"non-compliant\" without a court order.\nc) Section 15: Imposes a mandatory permit fee of KES 50,000 for existing structures and\nKES 75,000 for new structures in informal settlements.\nd) Section 18: Provides that failure to obtain a permit within 90 days of the Act's\ncommencement renders the structure illegal and subject to immediate demolition.\ne) Section 21: Excludes any right to compensation for demolished structures.\n3.5 On 10th July 2024, the Petitioner received a notice from the 1st Respondent's\nEnforcement Department stating that her dwelling structure was in violation of the impugned\nAct and would be demolished on 25th July 2024 unless she obtained the requisite permit.\n3.6 The Petitioner attempted to apply for the permit but was unable to raise the KES 50,000\nfee, which represents approximately eight months of her income from her vegetable stall.\n3.7 On 25th July 2024, at approximately 6:00 AM, County Enforcement Officers,\naccompanied by police officers, arrived at Kibera and proceeded to demolish approximately\n200 structures, including the Petitioner's home.\n3.8 The demolition was conducted without any court order and without providing alternative\naccommodation or compensation to the affected residents.\n3.9 The Petitioner and her children have since been living in a temporary shelter constructed\nfrom salvaged materials and are exposed to the elements, with no access to adequate\nsanitation or security.\n3.10 The Petitioner has suffered significant psychological trauma, and her children have\nbeen unable to attend school regularly due to lack of stable housing.\nC. CONSTITUTIONAL AND LEGAL VIOLATIONS\n4. VIOLATION OF THE RIGHT TO ACCESSIBLE AND ADEQUATE\nHOUSING (ARTICLE 43(1)(b))\n4.1 Article 43(1)(b) of the Constitution guarantees every person \"the right to accessible and\nadequate housing, and to reasonable standards of sanitation.\"\n4.2 The impugned Act and the subsequent demolitions have directly violated this\nconstitutional right by:\na) Rendering the Petitioner and her family homeless without providing alternative\naccommodation;\nb) Imposing prohibitive permit fees that are beyond the means of informal settlement\nresidents, thereby making housing inaccessible;\nc) Failing to progressively realize the right to housing as required under Article 21(2) of the\nConstitution.\n4.3 In Satrose Ayuma & 11 Others v Registered Trustees of the Kenya Railways Staff\nRetirement Benefits Scheme & 2 Others [2016] eKLR, the Court of Appeal held that:\n\"The right to accessible and adequate housing under Article 43(1)(b) is not\nmerely a right to shelter but encompasses security of tenure, availability of\nservices, affordability, habitability, accessibility, location and cultural adequacy.\"\n4.4 The 1st Respondent has failed to provide any alternative housing or resettlement plan for\nthe affected residents, thereby violating the progressive realization principle.\n5. VIOLATION OF THE RIGHT TO HUMAN DIGNITY (ARTICLE 28)\n5.1 Article 28 of the Constitution provides that \"Every person has inherent dignity and the\nright to have that dignity respected and protected.\"\n5.2 The demolition of the Petitioner's home in the manner conducted, leaving her and her\nchildren exposed to the elements without shelter, has violated her fundamental right to\ndignity.\n5.3 In Francis Karioko Muruatetu & Another v Republic [2017] eKLR, the Supreme Court\nemphasized that:\n\"Human dignity is the foundation of all human rights and must be respected and\nprotected in all circumstances.\"\n5.4 The treatment of the Petitioner and other Kibera residents as though their homes and\nlives are disposable constitutes a grave affront to human dignity.\n6. VIOLATION OF THE RIGHT TO FAIR ADMINISTRATIVE ACTION\n(ARTICLE 47)\n6.1 Article 47 of the Constitution guarantees every person the right to administrative action\nthat is expeditious, efficient, lawful, reasonable, and procedurally fair.\n6.2 Section 12 of the impugned Act authorizes demolitions without a court order, thereby\nviolating the principles of fair administrative action by:\na) Failing to provide an opportunity for affected persons to be heard before demolition;\nb) Failing to provide reasons for the administrative decision to demolish;\nc) Denying affected persons the right to seek judicial review before the administrative action\nis executed.\n6.3 In Anarita Karimi Njeru v Republic [1979] eKLR, the Court of Appeal established the\nduty to afford a hearing before adverse administrative action, stating:\n\"The rules of natural justice require that a person be given notice and an\nopportunity to be heard before a decision affecting their rights is made.\"\n6.4 The 1st Respondent proceeded with demolitions without providing individual hearings or\nany meaningful opportunity for affected residents to present their cases.\n7. VIOLATION OF CHILDREN'S RIGHTS (ARTICLE 53)\n7.1 Article 53(1) of the Constitution provides that every child has the right to basic nutrition,\nshelter, basic health care, and education.\n7.2 The Petitioner's three children have been deprived of adequate shelter, their education\nhas been disrupted, and they have been exposed to health hazards as a result of the\ndemolition.\n7.3 In CMS & 12 Others v Attorney General & 2 Others [2020] eKLR, the High Court held\nthat:\n\"The State has an obligation to take positive measures to protect children's\nrights, and any action that exposes children to harm or deprivation violates\nArticle 53.\"\n7.4 The 1st Respondent failed to conduct any child impact assessment before undertaking\nthe demolitions, contrary to the principles in the Children Act, 2022.\n8. VIOLATION OF THE RIGHT TO PROPERTY (ARTICLE 40)\n8.1 Article 40(1) of the Constitution protects every person's right to own property either\nindividually or in association with others.\n8.2 Article 40(3) provides that the State shall not deprive a person of property without\ncompensation.\n8.3 The Petitioner had possessory rights over her dwelling and the improvements she made\nto it over fifteen years, which constitute property within the meaning of Article 40.\n8.4 In Mitubell Welfare Society v Kenya Airports Authority & 2 Others [2013] eKLR, the\nSupreme Court recognized that:\n\"Property rights extend beyond formal title to include possessory rights and\nlegitimate expectations of continued occupation.\"\n8.5 Section 21 of the impugned Act, which excludes compensation for demolished\nstructures, is unconstitutional and void as it violates Article 40(3).\n9. VIOLATION OF EQUALITY AND FREEDOM FROM DISCRIMINATION\n(ARTICLE 27)\n9.1 Article 27(1) provides that every person is equal before the law and has the right to equal\nprotection and equal benefit of the law.\n9.2 The impugned Act disproportionately affects poor and marginalized communities in\ninformal settlements while residents of formal housing areas are not subject to similar\narbitrary regulations or demolitions.\n9.3 The permit fees of KES 50,000-75,000 are discriminatory as they are unaffordable to\ninformal settlement residents whose average monthly income is approximately KES 6,000.\n9.4 In Federation of Women Lawyers (FIDA-K) & 5 Others v Attorney General &\nAnother [2019] eKLR, the Constitutional Court stated:\n\"Discrimination can occur through laws that are facially neutral but have a\ndisproportionate impact on marginalized groups.\"\n9.5 The impugned Act constitutes indirect discrimination against the poor and violates Article\n27.\n10. VIOLATION OF THE PRINCIPLE OF PUBLIC PARTICIPATION\n(ARTICLE 10 AND 196)\n10.1 Article 10(2)(a) of the Constitution establishes public participation as a national value\nand principle of governance.\n10.2 Article 196(1) specifically requires County Governments to conduct public participation\nin the exercise of their powers and performance of functions.\n10.3 The 3rd Respondent enacted the impugned Act without meaningful public participation,\nparticularly without consulting the residents of informal settlements who would be directly\naffected.\n10.4 In Doctors for Life International v Speaker of the National Assembly & Others\n(CCT 12/05) [2006] ZACC 11 (a persuasive South African authority frequently cited in\nKenya), the Constitutional Court held that:\n\"Public participation must be meaningful, and those most affected by legislation\nmust be given a reasonable opportunity to know about the issues and to have\nan adequate say.\"\n10.5 The 1st and 3rd Respondents failed to conduct any consultative forums in Kibera or\nother informal settlements before enacting the law.\nD. APPLICABLE LAW\n11. CONSTITUTIONAL PROVISIONS\n11.1 The following provisions of the Constitution of Kenya, 2010 are directly applicable:\nArticle 10 – National values and principles of governance, including human dignity, equity,\nsocial justice, and public participation.\nArticle 19(2) – The purpose of recognizing and protecting human rights and fundamental\nfreedoms is to preserve the dignity of individuals and communities.\nArticle 20 – Application of the Bill of Rights, particularly:\n● Article 20(2): The State and every State organ must respect, protect, promote and\nfulfill the rights in the Bill of Rights.\n● Article 20(4): The State must take legislative, policy and other measures, including\nsetting standards, to achieve the progressive realization of economic and social\nrights.\nArticle 21 – Implementation of rights and fundamental freedoms, which places an obligation\non the State to observe, respect, protect, promote and fulfill the rights in the Bill of Rights.\nArticle 22 – Enforcement of the Bill of Rights, which empowers any person to approach the\nHigh Court alleging that a right has been denied, violated or infringed.\nArticle 23 – Authority of courts to uphold and enforce the Bill of Rights, including granting\nappropriate relief and awarding compensation.\nArticle 27 – Equality and freedom from discrimination.\nArticle 28 – Right to human dignity.\nArticle 40 – Right to property, including protection against deprivation without compensation.\nArticle 43 – Economic and social rights, specifically:\n● Article 43(1)(b): The right to accessible and adequate housing and reasonable\nstandards of sanitation.\nArticle 47 – Right to fair administrative action.\nArticle 53 – Children's rights, including the right to shelter, education, and protection from\nharm.\nArticle 165(3)(d) – Jurisdiction of the High Court to hear constitutional matters.\nArticle 176 – Establishment and powers of County Governments.\nArticle 196 – Public participation in County Government functions.\n12. STATUTORY LAW\n12.1 The Fair Administrative Action Act, No. 4 of 2015\nSection 4 provides that administrative action must be:\n● Procedurally fair\n● Expeditious, efficient, lawful, reasonable and proportionate\nSection 6 requires that before making a decision affecting a person's rights, the administrator\nmust give notice and opportunity to make representations.\n12.2 The Children Act, 2022\nSection 9 places a duty on the State to progressively implement children's rights, including\nthe right to shelter.\n12.3 The Environment and Land Court Act, 2011\nSection 13 grants the Court jurisdiction over matters relating to environmental and land use\nplanning.\n13. INTERNATIONAL LAW\n13.1 Pursuant to Article 2(5) and (6) of the Constitution, general rules of international law\nand treaties ratified by Kenya form part of Kenyan law.\n13.2 International Covenant on Economic, Social and Cultural Rights (ICESCR)\nKenya ratified the ICESCR in 1972. Article 11(1) recognizes \"the right of everyone to an\nadequate standard of living for himself and his family, including adequate food, clothing and\nhousing.\"\nGeneral Comment No. 4 on the right to adequate housing emphasizes security of tenure,\nprotection against forced evictions, and the requirement of alternative accommodation.\n13.3 The African Charter on Human and Peoples' Rights\nKenya ratified the Charter in 1992. Article 14 protects the right to property, and Article 18\nrequires the State to ensure the protection of the family.\n13.4 Convention on the Rights of the Child (CRC)\nKenya ratified the CRC in 1990. Article 27 recognizes the right of every child to a standard of\nliving adequate for the child's physical, mental, spiritual, moral and social development.\nE. GROUNDS OF THE PETITION\n14. ILLEGALITY AND UNCONSTITUTIONALITY OF THE IMPUGNED ACT\n14.1 The impugned Act is unconstitutional, illegal, null and void ab initio for the following\nreasons:\na) It violates Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) It was enacted without public participation in violation of Articles 10 and 196 of the\nConstitution;\nc) It imposes disproportionate and discriminatory financial burdens on the poor;\nd) It authorizes arbitrary administrative action without judicial oversight;\ne) It excludes compensation in violation of Article 40(3);\nf) It fails to provide for alternative accommodation or progressive realization of housing\nrights.\n15. ILLEGALITY OF THE DEMOLITIONS\n15.1 The demolitions conducted on 25th July 2024 were illegal, unconstitutional and violated\nthe Petitioner's fundamental rights because:\na) They were conducted without court orders;\nb) No individual notice or hearing was provided to affected residents;\nc) No alternative accommodation was provided;\nd) No compensation was offered;\ne) The actions violated the principles of fair administrative action under Article 47;\nf) The demolitions exposed children to harm in violation of Article 53;\ng) The actions violated international law standards on forced evictions.\n16. FAILURE OF CONSTITUTIONAL OBLIGATIONS\n16.1 The Respondents have failed in their constitutional obligations under Article 21 to\nrespect, protect, promote and fulfill the rights in the Bill of Rights.\n16.2 The Respondents have failed to progressively realize the right to housing under Article\n43 and have instead taken retrogressive measures.\nF. RELIEFS SOUGHT\n17. WHEREFORE, the Petitioner humbly prays that this Honourable\nCourt be pleased to:\nDECLARATIONS\na) DECLARE that Sections 7, 12, 15, 18, and 21 of The Nairobi City County Informal\nSettlements (Regulation and Control) Act, 2024 are unconstitutional, null and void for\nviolating Articles 27, 28, 40, 43, 47, and 53 of the Constitution;\nb) DECLARE that the demolition of the Petitioner's dwelling on 25th July 2024 was illegal,\nunconstitutional and violated the Petitioner's rights under Articles 28, 40, 43, 47, and 53 of\nthe Constitution;\nc) DECLARE that the 1st and 3rd Respondents violated the Petitioner's right to public\nparticipation under Articles 10 and 196 of the Constitution by enacting the impugned Act\nwithout meaningful consultation with informal settlement residents;\nd) DECLARE that the Respondents have a constitutional obligation to progressively realize\nthe right to adequate housing under Article 43(1)(b) and must take positive measures to\nprovide housing for informal settlement residents;\nORDERS\ne) ORDER that the 1st Respondent immediately provide the Petitioner with alternative\nadequate temporary housing pending permanent resettlement;\nf) ORDER the 1st Respondent to compensate the Petitioner for the demolition of her\ndwelling and for the violation of her constitutional rights;\ng) ORDER the 1st and 3rd Respondents to develop, within six (6) months, a comprehensive\ninformal settlements upgrading policy that complies with constitutional requirements,\nincludes public participation, provides for security of tenure, and progressively realizes\nhousing rights;\nh) ORDER the 1st Respondent to immediately cease all further demolitions in informal\nsettlements until a constitutional policy framework is established;\ni) ISSUE a permanent injunction restraining the Respondents from implementing Sections 7,\n12, 15, 18, and 21 of the impugned Act;\nGENERAL RELIEF\nj) AWARD general and aggravated damages to the Petitioner for violation of her\nconstitutional rights;\nk) AWARD the costs of this Petition;\nl) GRANT any other relief that this Honourable Court may deem just and appropriate.\nG. CERTIFICATION OF URGENCY\n18. This Petition is urgent and requires immediate hearing because:\na) The Petitioner and her children are currently homeless and living in dehumanizing\nconditions;\nb) The children's health, safety, and education are at immediate risk;\nc) The 1st Respondent continues to conduct demolitions in informal settlements, affecting\nthousands of residents;\nd) The rainy season is approaching, which will further expose homeless residents to\nlife-threatening conditions;\ne) Irreparable harm is being suffered daily by the Petitioner and other affected persons.\nH. NOTICE TO THE ATTORNEY GENERAL\n19. Notice of this Constitutional Petition has been duly served upon the Attorney General\npursuant to Article 165(4) of the Constitution and Order 34 Rule 5 of the Constitution\nof Kenya (Protection of Rights and Fundamental Freedoms) Practice and Procedure\nRules, 2013.\nDATED at Nairobi this 15th day of August, 2024\nFILED by:\nKAMAU & ASSOCIATES ADVOCATES\nAdvocates for the Petitioner\nP.O. Box 12345-00100\nNairobi, Kenya\nTel: +254 712 345 678\nEmail: info@kamauadvocates.co.ke\nSIGNED:\nJAMES KAMAU MWANGI\nAdvocate for the Petitioner\nSCHEDULE OF DOCUMENTS\n1. Copy of the Petitioner's National Identity Card\n2. Copy of The Nairobi City County Informal Settlements (Regulation and Control) Act,\n2024\n3. Demolition Notice dated 10th July 2024\n4. Photographs of the Petitioner's demolished dwelling\n5. Photographs of current temporary shelter\n6. Medical report on the psychological impact on the Petitioner's children\n7. Affidavit of service on the Attorney General\n8. List of 200 affected households in Kibera\nSUPPORTING AFFIDAVIT\nI, MARY WANJIKU KAMAU, of P.O. Box XXXX, Nairobi in the Republic of Kenya, do\nhereby make oath and state as follows:\n1. THAT I am the Petitioner herein and am conversant with the facts of this case.\n2. THAT the facts deposed to in this Affidavit are true to the best of my knowledge,\ninformation and belief.\n3. THAT the contents of the foregoing Petition are true and accurate.\n4. THAT I have resided in Kibera for fifteen years and have made my dwelling there my\nfamily home.\n5. THAT I am a small-scale trader earning approximately KES 6,000 per month from\nselling vegetables at Toi Market.\n6. THAT I used my limited savings over many years to improve my dwelling with iron\nsheets, a proper door, and a small extension for my children.\n7. THAT on 10th July 2024, I received a demolition notice giving me 15 days to obtain a\npermit costing KES 50,000.\n8. THAT I attempted to raise the money but it was impossible as it represents more than\neight months of my income.\n9. THAT on 25th July 2024, County officers demolished my home without giving me a\nchance to remove my belongings or to be heard.\n10. THAT my children and I have suffered greatly since the demolition and are living in\ninhumane conditions.\n11. THAT I was never consulted before the Act was passed and neither were other\nresidents of Kibera.\n12. THAT I bring this Petition in good faith to protect my rights and those of my children.\nSWORN at Nairobi\nthis 15th day of August 2024\nBEFORE ME:\nCOMMISSIONER FOR OATHS\nMARY WANJIKU KAMAU\nPetitioner\nEND OF PETITION",
      "type": "application/pdf"
    },
    "brief_Counter-Brief_The_Countys_Lawful_Authority_and_Pro_2025-12-21T08-34-24.pdf": {
      "name": "brief_Counter-Brief_The_Countys_Lawful_Authority_and_Pro_2025-12-21T08-34-24.pdf",
      "content": "Your Honor,\n\nThe County Government asserts its lawful authority, derived from the County Governments Act, 2012, and the Physical and Land Use Planning Act, 2019, to manage urban development, enforce zoning regulations, and, where necessary, demolish illegal or unauthorized structures. This authority is essential for maintaining public order, ensuring safety, and implementing planned development initiatives.\n\nWhile the emotional narrative presented by the opposing counsel is duly noted, the core issue is the legality of the structure itself. The County has a mandate to prevent and remove constructions that do not comply with established planning laws and regulations. The demand for a permit fee, though disputed, underscores the regulatory framework in place, which the structure in question allegedly failed to meet.\n\nHowever, we concede that even in the exercise of this legitimate authority, due process must be observed. Kenyan jurisprudence has consistently emphasized the importance of procedural safeguards. While previous rulings such as *Mitu-Bell Welfare Society v Kenya Airports Authority & 2 Others* (Petition No. 3 of 2018) highlight the need for notice, consultation, and often court orders, these cases often arise in contexts where the nature of the \"illegality\" or the history of occupation might be more complex.\n\nIn circumstances involving clear violations of planning and building codes, the County's ability to act decisively is crucial. The question before this court is to balance the individual's claims of constitutional rights against the County's obligation to uphold the law and protect the wider public interest through regulated development.\n\nWe argue that the County's actions, while potentially exhibiting procedural missteps, were fundamentally aimed at enforcing existing land use and building regulations. The absence of a valid permit suggests a prima facie illegality of the structure, which necessitated intervention. The focus should therefore shift to whether the procedural shortcomings, if proven, sufficiently invalidate an otherwise lawful exercise of statutory power.\n\nWe submit that the County acted within its general powers, and any alleged procedural lapses should be considered in light of the overarching public interest in regulated urban development and the enforcement of planning laws.\n\nRespectfully Submitted,\n\n[Your Name/Opposing Counsel]\nCounsel for the County Government",
      "type": "generated"
    }
  }
}